arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (INT6PL >= INT10PL) || (INT6PL == 0)
#define  MINT10_6PL    ~(1 << 5)
#else
#define  MINT10_6PL    0xFFFF
#endif

#if (INT7PL >= INT10PL) || (INT7PL == 0)
#define  MINT10_7PL    ~(1 << 6)
#else
#define  MINT10_7PL    0xFFFF
#endif

#if (INT8PL >= INT10PL) || (INT8PL == 0)
#define  MINT10_8PL    ~(1 << 7)
#else
#define  MINT10_8PL    0xFFFF
#endif

#if (INT9PL >= INT10PL) || (INT9PL == 0)
#define  MINT10_9PL    ~(1 << 8)
#else
#define  MINT10_9PL    0xFFFF
#endif

#if (INT10PL == 0)
#define  MINT10_10PL    ~(1 << 9)
#else
#define  MINT10_10PL    0xFFFF
#endif

#if (INT11PL >= INT10PL) || (INT11PL == 0)
#define  MINT10_11PL    ~(1 << 10)
#else
#define  MINT10_11PL    0xFFFF
#endif

#if (INT12PL >= INT10PL) || (INT12PL == 0)
#define  MINT10_12PL    ~(1 << 11)
#else
#define  MINT10_12PL    0xFFFF
#endif

#if (INT13PL >= INT10PL) || (INT13PL == 0)
#define  MINT10_13PL    ~(1 << 12)
#else
#define  MINT10_13PL    0xFFFF
#endif

#if (INT14PL >= INT10PL) || (INT14PL == 0)
#define  MINT10_14PL    ~(1 << 13)
#else
#define  MINT10_14PL    0xFFFF
#endif

#if (INT15PL >= INT10PL) || (INT15PL == 0)
#define  MINT10_15PL    ~(1 << 14)
#else
#define  MINT10_15PL    0xFFFF
#endif

#if (INT16PL >= INT10PL) || (INT16PL == 0)
#define  MINT10_16PL    ~(1 << 15)
#else
#define  MINT10_16PL    0xFFFF
#endif

#define  MINT10    (MINT10_1PL  & MINT10_2PL  & MINT10_3PL  & MINT10_4PL  & \
                   MINT10_5PL  & MINT10_6PL  & MINT10_7PL  & MINT10_8PL  & \
                   MINT10_9PL  & MINT10_10PL & MINT10_11PL & MINT10_12PL & \
                   MINT10_13PL & MINT10_14PL & MINT10_15PL & MINT10_16PL)
// End Of MINT10.

// Beginning of MINT11:
#if (INT1PL >= INT11PL) || (INT1PL == 0)
#define  MINT11_1PL    ~(1 << 0)
#else
#define  MINT11_1PL    0xFFFF
#endif

#if (INT2PL >= INT11PL) || (INT2PL == 0)
#define  MINT11_2PL    ~(1 << 1)
#else
#define  MINT11_2PL    0xFFFF
#endif

#if (INT3PL >= INT11PL) || (INT3PL == 0)
#define  MINT11_3PL    ~(1 << 2)
#else
#define  MINT11_3PL    0xFFFF
#endif

#if (INT4PL >= INT11PL) || (INT4PL == 0)
#define  MINT11_4PL    ~(1 << 3)
#else
#define  MINT11_4PL    0xFFFF
#endif

#if (INT5PL >= INT11PL) || (INT5PL == 0)
#define  MINT11_5PL    ~(1 << 4)
#else
#define  MINT11_5PL    0xFFFF
#endif

#if (INT6PL >= INT11PL) || (INT6PL == 0)
#define  MINT11_6PL    ~(1 << 5)
#else
#define  MINT11_6PL    0xFFFF
#endif

#if (INT7PL >= INT11PL) || (INT7PL == 0)
#define  MINT11_7PL    ~(1 << 6)
#else
#define  MINT11_7PL    0xFFFF
#endif

#if (INT8PL >= INT11PL) || (INT8PL == 0)
#define  MINT11_8PL    ~(1 << 7)
#else
#define  MINT11_8PL    0xFFFF
#endif

#if (INT9PL >= INT11PL) || (INT9PL == 0)
#define  MINT11_9PL    ~(1 << 8)
#else
#define  MINT11_9PL    0xFFFF
#endif

#if (INT10PL >= INT11PL) || (INT10PL == 0)
#define  MINT11_10PL    ~(1 << 9)
#else
#define  MINT11_10PL    0xFFFF
#endif

#if (INT11PL == 0)
#define  MINT11_11PL    ~(1 << 10)
#else
#define  MINT11_11PL    0xFFFF
#endif

#if (INT12PL >= INT11PL) || (INT12PL == 0)
#define  MINT11_12PL    ~(1 << 11)
#else
#define  MINT11_12PL    0xFFFF
#endif

#if (INT13PL >= INT11PL) || (INT13PL == 0)
#define  MINT11_13PL    ~(1 << 12)
#else
#define  MINT11_13PL    0xFFFF
#endif

#if (INT14PL >= INT11PL) || (INT14PL == 0)
#define  MINT11_14PL    ~(1 << 13)
#else
#define  MINT11_14PL    0xFFFF
#endif

#if (INT15PL >= INT11PL) || (INT15PL == 0)
#define  MINT11_15PL    ~(1 << 14)
#else
#define  MINT11_15PL    0xFFFF
#endif

#if (INT16PL >= INT11PL) || (INT16PL == 0)
#define  MINT11_16PL    ~(1 << 15)
#else
#define  MINT11_16PL    0xFFFF
#endif

#define  MINT11    (MINT11_1PL  & MINT11_2PL  & MINT11_3PL  & MINT11_4PL  & \
                   MINT11_5PL  & MINT11_6PL  & MINT11_7PL  & MINT11_8PL  & \
                   MINT11_9PL  & MINT11_10PL & MINT11_11PL & MINT11_12PL & \
                   MINT11_13PL & MINT11_14PL & MINT11_15PL & MINT11_16PL)
// End Of MINT11.

// Beginning of MINT12:
#if (INT1PL >= INT12PL) || (INT1PL == 0)
#define  MINT12_1PL    ~(1 << 0)
#else
#define  MINT12_1PL    0xFFFF
#endif

#if (INT2PL >= INT12PL) || (INT2PL == 0)
#define  MINT12_2PL    ~(1 << 1)
#else
#define  MINT12_2PL    0xFFFF
#endif

#if (INT3PL >= INT12PL) || (INT3PL == 0)
#define  MINT12_3PL    ~(1 << 2)
#else
#define  MINT12_3PL    0xFFFF
#endif

#if (INT4PL >= INT12PL) || (INT4PL == 0)
#define  MINT12_4PL    ~(1 << 3)
#else
#define  MINT12_4PL    0xFFFF
#endif

#if (INT5PL >= INT12PL) || (INT5PL == 0)
#define  MINT12_5PL    ~(1 << 4)
#else
#define  MINT12_5PL    0xFFFF
#endif

#if (INT6PL >= INT12PL) || (INT6PL == 0)
#define  MINT12_6PL    ~(1 << 5)
#else
#define  MINT12_6PL    0xFFFF
#endif

#if (INT7PL >= INT12PL) || (INT7PL == 0)
#define  MINT12_7PL    ~(1 << 6)
#else
#define  MINT12_7PL    0xFFFF
#endif

#if (INT8PL >= INT12PL) || (INT8PL == 0)
#define  MINT12_8PL    ~(1 << 7)
#else
#define  MINT12_8PL    0xFFFF
#endif

#if (INT9PL >= INT12PL) || (INT9PL == 0)
#define  MINT12_9PL    ~(1 << 8)
#else
#define  MINT12_9PL    0xFFFF
#endif

#if (INT10PL >= INT12PL) || (INT10PL == 0)
#define  MINT12_10PL    ~(1 << 9)
#else
#define  MINT12_10PL    0xFFFF
#endif

#if (INT11PL >= INT12PL) || (INT11PL == 0)
#define  MINT12_11PL    ~(1 << 10)
#else
#define  MINT12_11PL    0xFFFF
#endif

#if (INT12PL == 0)
#define  MINT12_12PL    ~(1 << 11)
#else
#define  MINT12_12PL    0xFFFF
#endif

#if (INT13PL >= INT12PL) || (INT13PL == 0)
#define  MINT12_13PL    ~(1 << 12)
#else
#define  MINT12_13PL    0xFFFF
#endif

#if (INT14PL >= INT12PL) || (INT14PL == 0)
#define  MINT12_14PL    ~(1 << 13)
#else
#define  MINT12_14PL    0xFFFF
#endif

#if (INT15PL >= INT12PL) || (INT15PL == 0)
#define  MINT12_15PL    ~(1 << 14)
#else
#define  MINT12_15PL    0xFFFF
#endif

#if (INT16PL >= INT12PL) || (INT16PL == 0)
#define  MINT12_16PL    ~(1 << 15)
#else
#define  MINT12_16PL    0xFFFF
#endif

#define  MINT12    (MINT12_1PL  & MINT12_2PL  & MINT12_3PL  & MINT12_4PL  & \
                   MINT12_5PL  & MINT12_6PL  & MINT12_7PL  & MINT12_8PL  & \
                   MINT12_9PL  & MINT12_10PL & MINT12_11PL & MINT12_12PL & \
                   MINT12_13PL & MINT12_14PL & MINT12_15PL & MINT12_16PL)
// End Of MINT12.

// Beginning of MINT13:
#if (INT1PL >= INT13PL) || (INT1PL == 0)
#define  MINT13_1PL    ~(1 << 0)
#else
#define  MINT13_1PL    0xFFFF
#endif

#if (INT2PL >= INT13PL) || (INT2PL == 0)
#define  MINT13_2PL    ~(1 << 1)
#else
#define  MINT13_2PL    0xFFFF
#endif

