arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G2_13PL >= G2_2PL) || (G2_13PL == 0)
#define  MG2_2_113PL    ~(1 << 12)
#else
#define  MG2_2_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_2PL) || (G2_14PL == 0)
#define  MG2_2_114PL    ~(1 << 13)
#else
#define  MG2_2_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_2PL) || (G2_15PL == 0)
#define  MG2_2_115PL    ~(1 << 14)
#else
#define  MG2_2_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_2PL) || (G2_16PL == 0)
#define  MG2_2_116PL    ~(1 << 15)
#else
#define  MG2_2_116PL    0xFFFF
#endif

#define  MG2_2_12PL	0xFFFD
#define  MG2_2    (MG2_2_11PL & MG2_2_12PL & MG2_2_13PL & MG2_2_14PL & \
                    MG2_2_15PL & MG2_2_16PL & MG2_2_17PL & MG2_2_18PL & \
                    MG2_2_19PL & MG2_2_110PL & MG2_2_111PL & MG2_2_112PL & \
                    MG2_2_113PL & MG2_2_114PL & MG2_2_115PL & MG2_2_116PL)
// End of MG2_2:
// Beginning of MG23:
#if (G2_1PL >= G2_3PL) || (G2_1PL == 0)
#define  MG2_3_11PL    ~(1 << 0)
#else
#define  MG2_3_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_3PL) || (G2_2PL == 0)
#define  MG2_3_12PL    ~(1 << 1)
#else
#define  MG2_3_12PL    0xFFFF
#endif

#if (G2_4PL >= G2_3PL) || (G2_4PL == 0)
#define  MG2_3_14PL    ~(1 << 3)
#else
#define  MG2_3_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_3PL) || (G2_5PL == 0)
#define  MG2_3_15PL    ~(1 << 4)
#else
#define  MG2_3_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_3PL) || (G2_6PL == 0)
#define  MG2_3_16PL    ~(1 << 5)
#else
#define  MG2_3_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_3PL) || (G2_7PL == 0)
#define  MG2_3_17PL    ~(1 << 6)
#else
#define  MG2_3_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_3PL) || (G2_8PL == 0)
#define  MG2_3_18PL    ~(1 << 7)
#else
#define  MG2_3_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_3PL) || (G2_9PL == 0)
#define  MG2_3_19PL    ~(1 << 8)
#else
#define  MG2_3_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_3PL) || (G2_10PL == 0)
#define  MG2_3_110PL    ~(1 << 9)
#else
#define  MG2_3_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_3PL) || (G2_11PL == 0)
#define  MG2_3_111PL    ~(1 << 10)
#else
#define  MG2_3_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_3PL) || (G2_12PL == 0)
#define  MG2_3_112PL    ~(1 << 11)
#else
#define  MG2_3_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_3PL) || (G2_13PL == 0)
#define  MG2_3_113PL    ~(1 << 12)
#else
#define  MG2_3_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_3PL) || (G2_14PL == 0)
#define  MG2_3_114PL    ~(1 << 13)
#else
#define  MG2_3_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_3PL) || (G2_15PL == 0)
#define  MG2_3_115PL    ~(1 << 14)
#else
#define  MG2_3_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_3PL) || (G2_16PL == 0)
#define  MG2_3_116PL    ~(1 << 15)
#else
#define  MG2_3_116PL    0xFFFF
#endif

#define  MG2_3_13PL	0xFFFB
#define  MG2_3    (MG2_3_11PL & MG2_3_12PL & MG2_3_13PL & MG2_3_14PL & \
                    MG2_3_15PL & MG2_3_16PL & MG2_3_17PL & MG2_3_18PL & \
                    MG2_3_19PL & MG2_3_110PL & MG2_3_111PL & MG2_3_112PL & \
                    MG2_3_113PL & MG2_3_114PL & MG2_3_115PL & MG2_3_116PL)
// End of MG2_3:
// Beginning of MG24:
#if (G2_1PL >= G2_4PL) || (G2_1PL == 0)
#define  MG2_4_11PL    ~(1 << 0)
#else
#define  MG2_4_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_4PL) || (G2_2PL == 0)
#define  MG2_4_12PL    ~(1 << 1)
#else
#define  MG2_4_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_4PL) || (G2_3PL == 0)
#define  MG2_4_13PL    ~(1 << 2)
#else
#define  MG2_4_13PL    0xFFFF
#endif

#if (G2_5PL >= G2_4PL) || (G2_5PL == 0)
#define  MG2_4_15PL    ~(1 << 4)
#else
#define  MG2_4_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_4PL) || (G2_6PL == 0)
#define  MG2_4_16PL    ~(1 << 5)
#else
#define  MG2_4_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_4PL) || (G2_7PL == 0)
#define  MG2_4_17PL    ~(1 << 6)
#else
#define  MG2_4_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_4PL) || (G2_8PL == 0)
#define  MG2_4_18PL    ~(1 << 7)
#else
#define  MG2_4_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_4PL) || (G2_9PL == 0)
#define  MG2_4_19PL    ~(1 << 8)
#else
#define  MG2_4_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_4PL) || (G2_10PL == 0)
#define  MG2_4_110PL    ~(1 << 9)
#else
#define  MG2_4_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_4PL) || (G2_11PL == 0)
#define  MG2_4_111PL    ~(1 << 10)
#else
#define  MG2_4_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_4PL) || (G2_12PL == 0)
#define  MG2_4_112PL    ~(1 << 11)
#else
#define  MG2_4_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_4PL) || (G2_13PL == 0)
#define  MG2_4_113PL    ~(1 << 12)
#else
#define  MG2_4_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_4PL) || (G2_14PL == 0)
#define  MG2_4_114PL    ~(1 << 13)
#else
#define  MG2_4_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_4PL) || (G2_15PL == 0)
#define  MG2_4_115PL    ~(1 << 14)
#else
#define  MG2_4_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_4PL) || (G2_16PL == 0)
#define  MG2_4_116PL    ~(1 << 15)
#else
#define  MG2_4_116PL    0xFFFF
#endif

#define  MG2_4_14PL	0xFFF7
#define  MG2_4    (MG2_4_11PL & MG2_4_12PL & MG2_4_13PL & MG2_4_14PL & \
                    MG2_4_15PL & MG2_4_16PL & MG2_4_17PL & MG2_4_18PL & \
                    MG2_4_19PL & MG2_4_110PL & MG2_4_111PL & MG2_4_112PL & \
                    MG2_4_113PL & MG2_4_114PL & MG2_4_115PL & MG2_4_116PL)
// End of MG2_4:
// Beginning of MG25:
#if (G2_1PL >= G2_5PL) || (G2_1PL == 0)
#define  MG2_5_11PL    ~(1 << 0)
#else
#define  MG2_5_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_5PL) || (G2_2PL == 0)
#define  MG2_5_12PL    ~(1 << 1)
#else
#define  MG2_5_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_5PL) || (G2_3PL == 0)
#define  MG2_5_13PL    ~(1 << 2)
#else
#define  MG2_5_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_5PL) || (G2_4PL == 0)
#define  MG2_5_14PL    ~(1 << 3)
#else
#define  MG2_5_14PL    0xFFFF
#endif

#if (G2_6PL >= G2_5PL) || (G2_6PL == 0)
#define  MG2_5_16PL    ~(1 << 5)
#else
#define  MG2_5_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_5PL) || (G2_7PL == 0)
#define  MG2_5_17PL    ~(1 << 6)
#else
#define  MG2_5_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_5PL) || (G2_8PL == 0)
#define  MG2_5_18PL    ~(1 << 7)
#else
#define  MG2_5_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_5PL) || (G2_9PL == 0)
#define  MG2_5_19PL    ~(1 << 8)
#else
#define  MG2_5_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_5PL) || (G2_10PL == 0)
#define  MG2_5_110PL    ~(1 << 9)
#else
#define  MG2_5_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_5PL) || (G2_11PL == 0)
#define  MG2_5_111PL    ~(1 << 10)
#else
#define  MG2_5_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_5PL) || (G2_12PL == 0)
#define  MG2_5_112PL    ~(1 << 11)
#else
#define  MG2_5_112PL    0xFFFF
#endif

