arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G2_7PL >= G2_14PL) || (G2_7PL == 0)
#define  MG2_14_17PL    ~(1 << 6)
#else
#define  MG2_14_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_14PL) || (G2_8PL == 0)
#define  MG2_14_18PL    ~(1 << 7)
#else
#define  MG2_14_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_14PL) || (G2_9PL == 0)
#define  MG2_14_19PL    ~(1 << 8)
#else
#define  MG2_14_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_14PL) || (G2_10PL == 0)
#define  MG2_14_110PL    ~(1 << 9)
#else
#define  MG2_14_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_14PL) || (G2_11PL == 0)
#define  MG2_14_111PL    ~(1 << 10)
#else
#define  MG2_14_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_14PL) || (G2_12PL == 0)
#define  MG2_14_112PL    ~(1 << 11)
#else
#define  MG2_14_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_14PL) || (G2_13PL == 0)
#define  MG2_14_113PL    ~(1 << 12)
#else
#define  MG2_14_113PL    0xFFFF
#endif

#if (G2_15PL >= G2_14PL) || (G2_15PL == 0)
#define  MG2_14_115PL    ~(1 << 14)
#else
#define  MG2_14_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_14PL) || (G2_16PL == 0)
#define  MG2_14_116PL    ~(1 << 15)
#else
#define  MG2_14_116PL    0xFFFF
#endif

#define  MG2_14_114PL	0xDFFF
#define  MG2_14    (MG2_14_11PL & MG2_14_12PL & MG2_14_13PL & MG2_14_14PL & \
                    MG2_14_15PL & MG2_14_16PL & MG2_14_17PL & MG2_14_18PL & \
                    MG2_14_19PL & MG2_14_110PL & MG2_14_111PL & MG2_14_112PL & \
                    MG2_14_113PL & MG2_14_114PL & MG2_14_115PL & MG2_14_116PL)
// End of MG2_14:
// Beginning of MG215:
#if (G2_1PL >= G2_15PL) || (G2_1PL == 0)
#define  MG2_15_11PL    ~(1 << 0)
#else
#define  MG2_15_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_15PL) || (G2_2PL == 0)
#define  MG2_15_12PL    ~(1 << 1)
#else
#define  MG2_15_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_15PL) || (G2_3PL == 0)
#define  MG2_15_13PL    ~(1 << 2)
#else
#define  MG2_15_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_15PL) || (G2_4PL == 0)
#define  MG2_15_14PL    ~(1 << 3)
#else
#define  MG2_15_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_15PL) || (G2_5PL == 0)
#define  MG2_15_15PL    ~(1 << 4)
#else
#define  MG2_15_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_15PL) || (G2_6PL == 0)
#define  MG2_15_16PL    ~(1 << 5)
#else
#define  MG2_15_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_15PL) || (G2_7PL == 0)
#define  MG2_15_17PL    ~(1 << 6)
#else
#define  MG2_15_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_15PL) || (G2_8PL == 0)
#define  MG2_15_18PL    ~(1 << 7)
#else
#define  MG2_15_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_15PL) || (G2_9PL == 0)
#define  MG2_15_19PL    ~(1 << 8)
#else
#define  MG2_15_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_15PL) || (G2_10PL == 0)
#define  MG2_15_110PL    ~(1 << 9)
#else
#define  MG2_15_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_15PL) || (G2_11PL == 0)
#define  MG2_15_111PL    ~(1 << 10)
#else
#define  MG2_15_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_15PL) || (G2_12PL == 0)
#define  MG2_15_112PL    ~(1 << 11)
#else
#define  MG2_15_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_15PL) || (G2_13PL == 0)
#define  MG2_15_113PL    ~(1 << 12)
#else
#define  MG2_15_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_15PL) || (G2_14PL == 0)
#define  MG2_15_114PL    ~(1 << 13)
#else
#define  MG2_15_114PL    0xFFFF
#endif

#if (G2_16PL >= G2_15PL) || (G2_16PL == 0)
#define  MG2_15_116PL    ~(1 << 15)
#else
#define  MG2_15_116PL    0xFFFF
#endif

#define  MG2_15_115PL	0xBFFF
#define  MG2_15    (MG2_15_11PL & MG2_15_12PL & MG2_15_13PL & MG2_15_14PL & \
                    MG2_15_15PL & MG2_15_16PL & MG2_15_17PL & MG2_15_18PL & \
                    MG2_15_19PL & MG2_15_110PL & MG2_15_111PL & MG2_15_112PL & \
                    MG2_15_113PL & MG2_15_114PL & MG2_15_115PL & MG2_15_116PL)
// End of MG2_15:
// Beginning of MG216:
#if (G2_1PL >= G2_16PL) || (G2_1PL == 0)
#define  MG2_16_11PL    ~(1 << 0)
#else
#define  MG2_16_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_16PL) || (G2_2PL == 0)
#define  MG2_16_12PL    ~(1 << 1)
#else
#define  MG2_16_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_16PL) || (G2_3PL == 0)
#define  MG2_16_13PL    ~(1 << 2)
#else
#define  MG2_16_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_16PL) || (G2_4PL == 0)
#define  MG2_16_14PL    ~(1 << 3)
#else
#define  MG2_16_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_16PL) || (G2_5PL == 0)
#define  MG2_16_15PL    ~(1 << 4)
#else
#define  MG2_16_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_16PL) || (G2_6PL == 0)
#define  MG2_16_16PL    ~(1 << 5)
#else
#define  MG2_16_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_16PL) || (G2_7PL == 0)
#define  MG2_16_17PL    ~(1 << 6)
#else
#define  MG2_16_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_16PL) || (G2_8PL == 0)
#define  MG2_16_18PL    ~(1 << 7)
#else
#define  MG2_16_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_16PL) || (G2_9PL == 0)
#define  MG2_16_19PL    ~(1 << 8)
#else
#define  MG2_16_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_16PL) || (G2_10PL == 0)
#define  MG2_16_110PL    ~(1 << 9)
#else
#define  MG2_16_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_16PL) || (G2_11PL == 0)
#define  MG2_16_111PL    ~(1 << 10)
#else
#define  MG2_16_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_16PL) || (G2_12PL == 0)
#define  MG2_16_112PL    ~(1 << 11)
#else
#define  MG2_16_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_16PL) || (G2_13PL == 0)
#define  MG2_16_113PL    ~(1 << 12)
#else
#define  MG2_16_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_16PL) || (G2_14PL == 0)
#define  MG2_16_114PL    ~(1 << 13)
#else
#define  MG2_16_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_16PL) || (G2_15PL == 0)
#define  MG2_16_115PL    ~(1 << 14)
#else
#define  MG2_16_115PL    0xFFFF
#endif

#define  MG2_16_116PL	0x7FFF
#define  MG2_16    (MG2_16_11PL & MG2_16_12PL & MG2_16_13PL & MG2_16_14PL & \
                    MG2_16_15PL & MG2_16_16PL & MG2_16_17PL & MG2_16_18PL & \
                    MG2_16_19PL & MG2_16_110PL & MG2_16_111PL & MG2_16_112PL & \
                    MG2_16_113PL & MG2_16_114PL & MG2_16_115PL & MG2_16_116PL)
// End of MG2_16:


//-------------------------------------------------------------------------------
// Automatically generate PIEIER3 interrupt masks MG31 to MG316:

// Beginning of MG31:
#if (G3_2PL >= G3_1PL) || (G3_2PL == 0)
#define  MG3_1_12PL    ~(1 << 1)
#else
#define  MG3_1_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_1PL) || (G3_3PL == 0)
#define  MG3_1_13PL    ~(1 << 2)
#else
#define  MG3_1_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_1PL) || (G3_4PL == 0)
#define  MG3_1_14PL    ~(1 << 3)
#else
#define  MG3_1_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_1PL) || (G3_5PL == 0)
#define  MG3_1_15PL    ~(1 << 4)
#else
#define  MG3_1_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_1PL) || (G3_6PL == 0)
#define  MG3_1_16PL    ~(1 << 5)
#else
#define  MG3_1_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_1PL) || (G3_7PL == 0)
#define  MG3_1_17PL    ~(1 << 6)
#else
#define  MG3_1_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_1PL) || (G3_8PL == 0)
#define  MG3_1_18PL    ~(1 << 7)
#else
#define  MG3_1_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_1PL) || (G3_9PL == 0)
#define  MG3_1_19PL    ~(1 << 8)
#else
#define  MG3_1_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_1PL) || (G3_10PL == 0)
#define  MG3_1_110PL    ~(1 << 9)
#else
#define  MG3_1_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_1PL) || (G3_11PL == 0)
#define  MG3_1_111PL    ~(1 << 10)
#else
#define  MG3_1_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_1PL) || (G3_12PL == 0)
#define  MG3_1_112PL    ~(1 << 11)
#else
#define  MG3_1_112PL    0xFFFF
#endif

