arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G3_13PL >= G3_4PL) || (G3_13PL == 0)
#define  MG3_4_113PL    ~(1 << 12)
#else
#define  MG3_4_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_4PL) || (G3_14PL == 0)
#define  MG3_4_114PL    ~(1 << 13)
#else
#define  MG3_4_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_4PL) || (G3_15PL == 0)
#define  MG3_4_115PL    ~(1 << 14)
#else
#define  MG3_4_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_4PL) || (G3_16PL == 0)
#define  MG3_4_116PL    ~(1 << 15)
#else
#define  MG3_4_116PL    0xFFFF
#endif

#define  MG3_4_14PL	0xFFF7
#define  MG3_4    (MG3_4_11PL & MG3_4_12PL & MG3_4_13PL & MG3_4_14PL & \
                    MG3_4_15PL & MG3_4_16PL & MG3_4_17PL & MG3_4_18PL & \
                    MG3_4_19PL & MG3_4_110PL & MG3_4_111PL & MG3_4_112PL & \
                    MG3_4_113PL & MG3_4_114PL & MG3_4_115PL & MG3_4_116PL)
// End of MG3_4:
// Beginning of MG35:
#if (G3_1PL >= G3_5PL) || (G3_1PL == 0)
#define  MG3_5_11PL    ~(1 << 0)
#else
#define  MG3_5_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_5PL) || (G3_2PL == 0)
#define  MG3_5_12PL    ~(1 << 1)
#else
#define  MG3_5_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_5PL) || (G3_3PL == 0)
#define  MG3_5_13PL    ~(1 << 2)
#else
#define  MG3_5_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_5PL) || (G3_4PL == 0)
#define  MG3_5_14PL    ~(1 << 3)
#else
#define  MG3_5_14PL    0xFFFF
#endif

#if (G3_6PL >= G3_5PL) || (G3_6PL == 0)
#define  MG3_5_16PL    ~(1 << 5)
#else
#define  MG3_5_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_5PL) || (G3_7PL == 0)
#define  MG3_5_17PL    ~(1 << 6)
#else
#define  MG3_5_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_5PL) || (G3_8PL == 0)
#define  MG3_5_18PL    ~(1 << 7)
#else
#define  MG3_5_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_5PL) || (G3_9PL == 0)
#define  MG3_5_19PL    ~(1 << 8)
#else
#define  MG3_5_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_5PL) || (G3_10PL == 0)
#define  MG3_5_110PL    ~(1 << 9)
#else
#define  MG3_5_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_5PL) || (G3_11PL == 0)
#define  MG3_5_111PL    ~(1 << 10)
#else
#define  MG3_5_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_5PL) || (G3_12PL == 0)
#define  MG3_5_112PL    ~(1 << 11)
#else
#define  MG3_5_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_5PL) || (G3_13PL == 0)
#define  MG3_5_113PL    ~(1 << 12)
#else
#define  MG3_5_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_5PL) || (G3_14PL == 0)
#define  MG3_5_114PL    ~(1 << 13)
#else
#define  MG3_5_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_5PL) || (G3_15PL == 0)
#define  MG3_5_115PL    ~(1 << 14)
#else
#define  MG3_5_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_5PL) || (G3_16PL == 0)
#define  MG3_5_116PL    ~(1 << 15)
#else
#define  MG3_5_116PL    0xFFFF
#endif

#define  MG3_5_15PL	0xFFEF
#define  MG3_5    (MG3_5_11PL & MG3_5_12PL & MG3_5_13PL & MG3_5_14PL & \
                    MG3_5_15PL & MG3_5_16PL & MG3_5_17PL & MG3_5_18PL & \
                    MG3_5_19PL & MG3_5_110PL & MG3_5_111PL & MG3_5_112PL & \
                    MG3_5_113PL & MG3_5_114PL & MG3_5_115PL & MG3_5_116PL)
// End of MG3_5:
// Beginning of MG36:
#if (G3_1PL >= G3_6PL) || (G3_1PL == 0)
#define  MG3_6_11PL    ~(1 << 0)
#else
#define  MG3_6_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_6PL) || (G3_2PL == 0)
#define  MG3_6_12PL    ~(1 << 1)
#else
#define  MG3_6_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_6PL) || (G3_3PL == 0)
#define  MG3_6_13PL    ~(1 << 2)
#else
#define  MG3_6_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_6PL) || (G3_4PL == 0)
#define  MG3_6_14PL    ~(1 << 3)
#else
#define  MG3_6_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_6PL) || (G3_5PL == 0)
#define  MG3_6_15PL    ~(1 << 4)
#else
#define  MG3_6_15PL    0xFFFF
#endif

#if (G3_7PL >= G3_6PL) || (G3_7PL == 0)
#define  MG3_6_17PL    ~(1 << 6)
#else
#define  MG3_6_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_6PL) || (G3_8PL == 0)
#define  MG3_6_18PL    ~(1 << 7)
#else
#define  MG3_6_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_6PL) || (G3_9PL == 0)
#define  MG3_6_19PL    ~(1 << 8)
#else
#define  MG3_6_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_6PL) || (G3_10PL == 0)
#define  MG3_6_110PL    ~(1 << 9)
#else
#define  MG3_6_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_6PL) || (G3_11PL == 0)
#define  MG3_6_111PL    ~(1 << 10)
#else
#define  MG3_6_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_6PL) || (G3_12PL == 0)
#define  MG3_6_112PL    ~(1 << 11)
#else
#define  MG3_6_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_6PL) || (G3_13PL == 0)
#define  MG3_6_113PL    ~(1 << 12)
#else
#define  MG3_6_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_6PL) || (G3_14PL == 0)
#define  MG3_6_114PL    ~(1 << 13)
#else
#define  MG3_6_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_6PL) || (G3_15PL == 0)
#define  MG3_6_115PL    ~(1 << 14)
#else
#define  MG3_6_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_6PL) || (G3_16PL == 0)
#define  MG3_6_116PL    ~(1 << 15)
#else
#define  MG3_6_116PL    0xFFFF
#endif

#define  MG3_6_16PL	0xFFDF
#define  MG3_6    (MG3_6_11PL & MG3_6_12PL & MG3_6_13PL & MG3_6_14PL & \
                    MG3_6_15PL & MG3_6_16PL & MG3_6_17PL & MG3_6_18PL & \
                    MG3_6_19PL & MG3_6_110PL & MG3_6_111PL & MG3_6_112PL & \
                    MG3_6_113PL & MG3_6_114PL & MG3_6_115PL & MG3_6_116PL)
// End of MG3_6:
// Beginning of MG37:
#if (G3_1PL >= G3_7PL) || (G3_1PL == 0)
#define  MG3_7_11PL    ~(1 << 0)
#else
#define  MG3_7_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_7PL) || (G3_2PL == 0)
#define  MG3_7_12PL    ~(1 << 1)
#else
#define  MG3_7_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_7PL) || (G3_3PL == 0)
#define  MG3_7_13PL    ~(1 << 2)
#else
#define  MG3_7_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_7PL) || (G3_4PL == 0)
#define  MG3_7_14PL    ~(1 << 3)
#else
#define  MG3_7_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_7PL) || (G3_5PL == 0)
#define  MG3_7_15PL    ~(1 << 4)
#else
#define  MG3_7_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_7PL) || (G3_6PL == 0)
#define  MG3_7_16PL    ~(1 << 5)
#else
#define  MG3_7_16PL    0xFFFF
#endif

#if (G3_8PL >= G3_7PL) || (G3_8PL == 0)
#define  MG3_7_18PL    ~(1 << 7)
#else
#define  MG3_7_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_7PL) || (G3_9PL == 0)
#define  MG3_7_19PL    ~(1 << 8)
#else
#define  MG3_7_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_7PL) || (G3_10PL == 0)
#define  MG3_7_110PL    ~(1 << 9)
#else
#define  MG3_7_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_7PL) || (G3_11PL == 0)
#define  MG3_7_111PL    ~(1 << 10)
#else
#define  MG3_7_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_7PL) || (G3_12PL == 0)
#define  MG3_7_112PL    ~(1 << 11)
#else
#define  MG3_7_112PL    0xFFFF
#endif

