arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G3_7PL >= G3_11PL) || (G3_7PL == 0)
#define  MG3_11_17PL    ~(1 << 6)
#else
#define  MG3_11_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_11PL) || (G3_8PL == 0)
#define  MG3_11_18PL    ~(1 << 7)
#else
#define  MG3_11_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_11PL) || (G3_9PL == 0)
#define  MG3_11_19PL    ~(1 << 8)
#else
#define  MG3_11_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_11PL) || (G3_10PL == 0)
#define  MG3_11_110PL    ~(1 << 9)
#else
#define  MG3_11_110PL    0xFFFF
#endif

#if (G3_12PL >= G3_11PL) || (G3_12PL == 0)
#define  MG3_11_112PL    ~(1 << 11)
#else
#define  MG3_11_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_11PL) || (G3_13PL == 0)
#define  MG3_11_113PL    ~(1 << 12)
#else
#define  MG3_11_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_11PL) || (G3_14PL == 0)
#define  MG3_11_114PL    ~(1 << 13)
#else
#define  MG3_11_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_11PL) || (G3_15PL == 0)
#define  MG3_11_115PL    ~(1 << 14)
#else
#define  MG3_11_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_11PL) || (G3_16PL == 0)
#define  MG3_11_116PL    ~(1 << 15)
#else
#define  MG3_11_116PL    0xFFFF
#endif

#define  MG3_11_111PL	0xFBFF
#define  MG3_11    (MG3_11_11PL & MG3_11_12PL & MG3_11_13PL & MG3_11_14PL & \
                    MG3_11_15PL & MG3_11_16PL & MG3_11_17PL & MG3_11_18PL & \
                    MG3_11_19PL & MG3_11_110PL & MG3_11_111PL & MG3_11_112PL & \
                    MG3_11_113PL & MG3_11_114PL & MG3_11_115PL & MG3_11_116PL)
// End of MG3_11:
// Beginning of MG312:
#if (G3_1PL >= G3_12PL) || (G3_1PL == 0)
#define  MG3_12_11PL    ~(1 << 0)
#else
#define  MG3_12_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_12PL) || (G3_2PL == 0)
#define  MG3_12_12PL    ~(1 << 1)
#else
#define  MG3_12_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_12PL) || (G3_3PL == 0)
#define  MG3_12_13PL    ~(1 << 2)
#else
#define  MG3_12_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_12PL) || (G3_4PL == 0)
#define  MG3_12_14PL    ~(1 << 3)
#else
#define  MG3_12_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_12PL) || (G3_5PL == 0)
#define  MG3_12_15PL    ~(1 << 4)
#else
#define  MG3_12_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_12PL) || (G3_6PL == 0)
#define  MG3_12_16PL    ~(1 << 5)
#else
#define  MG3_12_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_12PL) || (G3_7PL == 0)
#define  MG3_12_17PL    ~(1 << 6)
#else
#define  MG3_12_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_12PL) || (G3_8PL == 0)
#define  MG3_12_18PL    ~(1 << 7)
#else
#define  MG3_12_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_12PL) || (G3_9PL == 0)
#define  MG3_12_19PL    ~(1 << 8)
#else
#define  MG3_12_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_12PL) || (G3_10PL == 0)
#define  MG3_12_110PL    ~(1 << 9)
#else
#define  MG3_12_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_12PL) || (G3_11PL == 0)
#define  MG3_12_111PL    ~(1 << 10)
#else
#define  MG3_12_111PL    0xFFFF
#endif

#if (G3_13PL >= G3_12PL) || (G3_13PL == 0)
#define  MG3_12_113PL    ~(1 << 12)
#else
#define  MG3_12_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_12PL) || (G3_14PL == 0)
#define  MG3_12_114PL    ~(1 << 13)
#else
#define  MG3_12_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_12PL) || (G3_15PL == 0)
#define  MG3_12_115PL    ~(1 << 14)
#else
#define  MG3_12_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_12PL) || (G3_16PL == 0)
#define  MG3_12_116PL    ~(1 << 15)
#else
#define  MG3_12_116PL    0xFFFF
#endif

#define  MG3_12_112PL	0xF7FF
#define  MG3_12    (MG3_12_11PL & MG3_12_12PL & MG3_12_13PL & MG3_12_14PL & \
                    MG3_12_15PL & MG3_12_16PL & MG3_12_17PL & MG3_12_18PL & \
                    MG3_12_19PL & MG3_12_110PL & MG3_12_111PL & MG3_12_112PL & \
                    MG3_12_113PL & MG3_12_114PL & MG3_12_115PL & MG3_12_116PL)
// End of MG3_12:
// Beginning of MG313:
#if (G3_1PL >= G3_13PL) || (G3_1PL == 0)
#define  MG3_13_11PL    ~(1 << 0)
#else
#define  MG3_13_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_13PL) || (G3_2PL == 0)
#define  MG3_13_12PL    ~(1 << 1)
#else
#define  MG3_13_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_13PL) || (G3_3PL == 0)
#define  MG3_13_13PL    ~(1 << 2)
#else
#define  MG3_13_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_13PL) || (G3_4PL == 0)
#define  MG3_13_14PL    ~(1 << 3)
#else
#define  MG3_13_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_13PL) || (G3_5PL == 0)
#define  MG3_13_15PL    ~(1 << 4)
#else
#define  MG3_13_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_13PL) || (G3_6PL == 0)
#define  MG3_13_16PL    ~(1 << 5)
#else
#define  MG3_13_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_13PL) || (G3_7PL == 0)
#define  MG3_13_17PL    ~(1 << 6)
#else
#define  MG3_13_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_13PL) || (G3_8PL == 0)
#define  MG3_13_18PL    ~(1 << 7)
#else
#define  MG3_13_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_13PL) || (G3_9PL == 0)
#define  MG3_13_19PL    ~(1 << 8)
#else
#define  MG3_13_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_13PL) || (G3_10PL == 0)
#define  MG3_13_110PL    ~(1 << 9)
#else
#define  MG3_13_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_13PL) || (G3_11PL == 0)
#define  MG3_13_111PL    ~(1 << 10)
#else
#define  MG3_13_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_13PL) || (G3_12PL == 0)
#define  MG3_13_112PL    ~(1 << 11)
#else
#define  MG3_13_112PL    0xFFFF
#endif

#if (G3_14PL >= G3_13PL) || (G3_14PL == 0)
#define  MG3_13_114PL    ~(1 << 13)
#else
#define  MG3_13_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_13PL) || (G3_15PL == 0)
#define  MG3_13_115PL    ~(1 << 14)
#else
#define  MG3_13_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_13PL) || (G3_16PL == 0)
#define  MG3_13_116PL    ~(1 << 15)
#else
#define  MG3_13_116PL    0xFFFF
#endif

#define  MG3_13_113PL	0xEFFF
#define  MG3_13    (MG3_13_11PL & MG3_13_12PL & MG3_13_13PL & MG3_13_14PL & \
                    MG3_13_15PL & MG3_13_16PL & MG3_13_17PL & MG3_13_18PL & \
                    MG3_13_19PL & MG3_13_110PL & MG3_13_111PL & MG3_13_112PL & \
                    MG3_13_113PL & MG3_13_114PL & MG3_13_115PL & MG3_13_116PL)
// End of MG3_13:
// Beginning of MG314:
#if (G3_1PL >= G3_14PL) || (G3_1PL == 0)
#define  MG3_14_11PL    ~(1 << 0)
#else
#define  MG3_14_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_14PL) || (G3_2PL == 0)
#define  MG3_14_12PL    ~(1 << 1)
#else
#define  MG3_14_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_14PL) || (G3_3PL == 0)
#define  MG3_14_13PL    ~(1 << 2)
#else
#define  MG3_14_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_14PL) || (G3_4PL == 0)
#define  MG3_14_14PL    ~(1 << 3)
#else
#define  MG3_14_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_14PL) || (G3_5PL == 0)
#define  MG3_14_15PL    ~(1 << 4)
#else
#define  MG3_14_15PL    0xFFFF
#endif

