arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G3_6PL >= G3_14PL) || (G3_6PL == 0)
#define  MG3_14_16PL    ~(1 << 5)
#else
#define  MG3_14_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_14PL) || (G3_7PL == 0)
#define  MG3_14_17PL    ~(1 << 6)
#else
#define  MG3_14_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_14PL) || (G3_8PL == 0)
#define  MG3_14_18PL    ~(1 << 7)
#else
#define  MG3_14_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_14PL) || (G3_9PL == 0)
#define  MG3_14_19PL    ~(1 << 8)
#else
#define  MG3_14_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_14PL) || (G3_10PL == 0)
#define  MG3_14_110PL    ~(1 << 9)
#else
#define  MG3_14_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_14PL) || (G3_11PL == 0)
#define  MG3_14_111PL    ~(1 << 10)
#else
#define  MG3_14_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_14PL) || (G3_12PL == 0)
#define  MG3_14_112PL    ~(1 << 11)
#else
#define  MG3_14_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_14PL) || (G3_13PL == 0)
#define  MG3_14_113PL    ~(1 << 12)
#else
#define  MG3_14_113PL    0xFFFF
#endif

#if (G3_15PL >= G3_14PL) || (G3_15PL == 0)
#define  MG3_14_115PL    ~(1 << 14)
#else
#define  MG3_14_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_14PL) || (G3_16PL == 0)
#define  MG3_14_116PL    ~(1 << 15)
#else
#define  MG3_14_116PL    0xFFFF
#endif

#define  MG3_14_114PL	0xDFFF
#define  MG3_14    (MG3_14_11PL & MG3_14_12PL & MG3_14_13PL & MG3_14_14PL & \
                    MG3_14_15PL & MG3_14_16PL & MG3_14_17PL & MG3_14_18PL & \
                    MG3_14_19PL & MG3_14_110PL & MG3_14_111PL & MG3_14_112PL & \
                    MG3_14_113PL & MG3_14_114PL & MG3_14_115PL & MG3_14_116PL)
// End of MG3_14:
// Beginning of MG315:
#if (G3_1PL >= G3_15PL) || (G3_1PL == 0)
#define  MG3_15_11PL    ~(1 << 0)
#else
#define  MG3_15_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_15PL) || (G3_2PL == 0)
#define  MG3_15_12PL    ~(1 << 1)
#else
#define  MG3_15_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_15PL) || (G3_3PL == 0)
#define  MG3_15_13PL    ~(1 << 2)
#else
#define  MG3_15_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_15PL) || (G3_4PL == 0)
#define  MG3_15_14PL    ~(1 << 3)
#else
#define  MG3_15_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_15PL) || (G3_5PL == 0)
#define  MG3_15_15PL    ~(1 << 4)
#else
#define  MG3_15_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_15PL) || (G3_6PL == 0)
#define  MG3_15_16PL    ~(1 << 5)
#else
#define  MG3_15_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_15PL) || (G3_7PL == 0)
#define  MG3_15_17PL    ~(1 << 6)
#else
#define  MG3_15_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_15PL) || (G3_8PL == 0)
#define  MG3_15_18PL    ~(1 << 7)
#else
#define  MG3_15_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_15PL) || (G3_9PL == 0)
#define  MG3_15_19PL    ~(1 << 8)
#else
#define  MG3_15_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_15PL) || (G3_10PL == 0)
#define  MG3_15_110PL    ~(1 << 9)
#else
#define  MG3_15_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_15PL) || (G3_11PL == 0)
#define  MG3_15_111PL    ~(1 << 10)
#else
#define  MG3_15_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_15PL) || (G3_12PL == 0)
#define  MG3_15_112PL    ~(1 << 11)
#else
#define  MG3_15_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_15PL) || (G3_13PL == 0)
#define  MG3_15_113PL    ~(1 << 12)
#else
#define  MG3_15_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_15PL) || (G3_14PL == 0)
#define  MG3_15_114PL    ~(1 << 13)
#else
#define  MG3_15_114PL    0xFFFF
#endif

#if (G3_16PL >= G3_15PL) || (G3_16PL == 0)
#define  MG3_15_116PL    ~(1 << 15)
#else
#define  MG3_15_116PL    0xFFFF
#endif

#define  MG3_15_115PL	0xBFFF
#define  MG3_15    (MG3_15_11PL & MG3_15_12PL & MG3_15_13PL & MG3_15_14PL & \
                    MG3_15_15PL & MG3_15_16PL & MG3_15_17PL & MG3_15_18PL & \
                    MG3_15_19PL & MG3_15_110PL & MG3_15_111PL & MG3_15_112PL & \
                    MG3_15_113PL & MG3_15_114PL & MG3_15_115PL & MG3_15_116PL)
// End of MG3_15:
// Beginning of MG316:
#if (G3_1PL >= G3_16PL) || (G3_1PL == 0)
#define  MG3_16_11PL    ~(1 << 0)
#else
#define  MG3_16_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_16PL) || (G3_2PL == 0)
#define  MG3_16_12PL    ~(1 << 1)
#else
#define  MG3_16_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_16PL) || (G3_3PL == 0)
#define  MG3_16_13PL    ~(1 << 2)
#else
#define  MG3_16_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_16PL) || (G3_4PL == 0)
#define  MG3_16_14PL    ~(1 << 3)
#else
#define  MG3_16_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_16PL) || (G3_5PL == 0)
#define  MG3_16_15PL    ~(1 << 4)
#else
#define  MG3_16_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_16PL) || (G3_6PL == 0)
#define  MG3_16_16PL    ~(1 << 5)
#else
#define  MG3_16_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_16PL) || (G3_7PL == 0)
#define  MG3_16_17PL    ~(1 << 6)
#else
#define  MG3_16_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_16PL) || (G3_8PL == 0)
#define  MG3_16_18PL    ~(1 << 7)
#else
#define  MG3_16_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_16PL) || (G3_9PL == 0)
#define  MG3_16_19PL    ~(1 << 8)
#else
#define  MG3_16_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_16PL) || (G3_10PL == 0)
#define  MG3_16_110PL    ~(1 << 9)
#else
#define  MG3_16_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_16PL) || (G3_11PL == 0)
#define  MG3_16_111PL    ~(1 << 10)
#else
#define  MG3_16_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_16PL) || (G3_12PL == 0)
#define  MG3_16_112PL    ~(1 << 11)
#else
#define  MG3_16_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_16PL) || (G3_13PL == 0)
#define  MG3_16_113PL    ~(1 << 12)
#else
#define  MG3_16_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_16PL) || (G3_14PL == 0)
#define  MG3_16_114PL    ~(1 << 13)
#else
#define  MG3_16_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_16PL) || (G3_15PL == 0)
#define  MG3_16_115PL    ~(1 << 14)
#else
#define  MG3_16_115PL    0xFFFF
#endif

#define  MG3_16_116PL	0x7FFF
#define  MG3_16    (MG3_16_11PL & MG3_16_12PL & MG3_16_13PL & MG3_16_14PL & \
                    MG3_16_15PL & MG3_16_16PL & MG3_16_17PL & MG3_16_18PL & \
                    MG3_16_19PL & MG3_16_110PL & MG3_16_111PL & MG3_16_112PL & \
                    MG3_16_113PL & MG3_16_114PL & MG3_16_115PL & MG3_16_116PL)
// End of MG3_16:


//-------------------------------------------------------------------------------
// Automatically generate PIEIER4 interrupt masks MG41 to MG416:

