arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#define  MG4_3_13PL	0xFFFB
#define  MG4_3    (MG4_3_11PL & MG4_3_12PL & MG4_3_13PL & MG4_3_14PL & \
                    MG4_3_15PL & MG4_3_16PL & MG4_3_17PL & MG4_3_18PL & \
                    MG4_3_19PL & MG4_3_110PL & MG4_3_111PL & MG4_3_112PL & \
                    MG4_3_113PL & MG4_3_114PL & MG4_3_115PL & MG4_3_116PL)
// End of MG4_3:
// Beginning of MG44:
#if (G4_1PL >= G4_4PL) || (G4_1PL == 0)
#define  MG4_4_11PL    ~(1 << 0)
#else
#define  MG4_4_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_4PL) || (G4_2PL == 0)
#define  MG4_4_12PL    ~(1 << 1)
#else
#define  MG4_4_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_4PL) || (G4_3PL == 0)
#define  MG4_4_13PL    ~(1 << 2)
#else
#define  MG4_4_13PL    0xFFFF
#endif

#if (G4_5PL >= G4_4PL) || (G4_5PL == 0)
#define  MG4_4_15PL    ~(1 << 4)
#else
#define  MG4_4_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_4PL) || (G4_6PL == 0)
#define  MG4_4_16PL    ~(1 << 5)
#else
#define  MG4_4_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_4PL) || (G4_7PL == 0)
#define  MG4_4_17PL    ~(1 << 6)
#else
#define  MG4_4_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_4PL) || (G4_8PL == 0)
#define  MG4_4_18PL    ~(1 << 7)
#else
#define  MG4_4_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_4PL) || (G4_9PL == 0)
#define  MG4_4_19PL    ~(1 << 8)
#else
#define  MG4_4_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_4PL) || (G4_10PL == 0)
#define  MG4_4_110PL    ~(1 << 9)
#else
#define  MG4_4_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_4PL) || (G4_11PL == 0)
#define  MG4_4_111PL    ~(1 << 10)
#else
#define  MG4_4_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_4PL) || (G4_12PL == 0)
#define  MG4_4_112PL    ~(1 << 11)
#else
#define  MG4_4_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_4PL) || (G4_13PL == 0)
#define  MG4_4_113PL    ~(1 << 12)
#else
#define  MG4_4_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_4PL) || (G4_14PL == 0)
#define  MG4_4_114PL    ~(1 << 13)
#else
#define  MG4_4_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_4PL) || (G4_15PL == 0)
#define  MG4_4_115PL    ~(1 << 14)
#else
#define  MG4_4_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_4PL) || (G4_16PL == 0)
#define  MG4_4_116PL    ~(1 << 15)
#else
#define  MG4_4_116PL    0xFFFF
#endif

#define  MG4_4_14PL	0xFFF7
#define  MG4_4    (MG4_4_11PL & MG4_4_12PL & MG4_4_13PL & MG4_4_14PL & \
                    MG4_4_15PL & MG4_4_16PL & MG4_4_17PL & MG4_4_18PL & \
                    MG4_4_19PL & MG4_4_110PL & MG4_4_111PL & MG4_4_112PL & \
                    MG4_4_113PL & MG4_4_114PL & MG4_4_115PL & MG4_4_116PL)
// End of MG4_4:
// Beginning of MG45:
#if (G4_1PL >= G4_5PL) || (G4_1PL == 0)
#define  MG4_5_11PL    ~(1 << 0)
#else
#define  MG4_5_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_5PL) || (G4_2PL == 0)
#define  MG4_5_12PL    ~(1 << 1)
#else
#define  MG4_5_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_5PL) || (G4_3PL == 0)
#define  MG4_5_13PL    ~(1 << 2)
#else
#define  MG4_5_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_5PL) || (G4_4PL == 0)
#define  MG4_5_14PL    ~(1 << 3)
#else
#define  MG4_5_14PL    0xFFFF
#endif

#if (G4_6PL >= G4_5PL) || (G4_6PL == 0)
#define  MG4_5_16PL    ~(1 << 5)
#else
#define  MG4_5_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_5PL) || (G4_7PL == 0)
#define  MG4_5_17PL    ~(1 << 6)
#else
#define  MG4_5_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_5PL) || (G4_8PL == 0)
#define  MG4_5_18PL    ~(1 << 7)
#else
#define  MG4_5_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_5PL) || (G4_9PL == 0)
#define  MG4_5_19PL    ~(1 << 8)
#else
#define  MG4_5_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_5PL) || (G4_10PL == 0)
#define  MG4_5_110PL    ~(1 << 9)
#else
#define  MG4_5_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_5PL) || (G4_11PL == 0)
#define  MG4_5_111PL    ~(1 << 10)
#else
#define  MG4_5_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_5PL) || (G4_12PL == 0)
#define  MG4_5_112PL    ~(1 << 11)
#else
#define  MG4_5_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_5PL) || (G4_13PL == 0)
#define  MG4_5_113PL    ~(1 << 12)
#else
#define  MG4_5_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_5PL) || (G4_14PL == 0)
#define  MG4_5_114PL    ~(1 << 13)
#else
#define  MG4_5_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_5PL) || (G4_15PL == 0)
#define  MG4_5_115PL    ~(1 << 14)
#else
#define  MG4_5_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_5PL) || (G4_16PL == 0)
#define  MG4_5_116PL    ~(1 << 15)
#else
#define  MG4_5_116PL    0xFFFF
#endif

#define  MG4_5_15PL	0xFFEF
#define  MG4_5    (MG4_5_11PL & MG4_5_12PL & MG4_5_13PL & MG4_5_14PL & \
                    MG4_5_15PL & MG4_5_16PL & MG4_5_17PL & MG4_5_18PL & \
                    MG4_5_19PL & MG4_5_110PL & MG4_5_111PL & MG4_5_112PL & \
                    MG4_5_113PL & MG4_5_114PL & MG4_5_115PL & MG4_5_116PL)
// End of MG4_5:
// Beginning of MG46:
#if (G4_1PL >= G4_6PL) || (G4_1PL == 0)
#define  MG4_6_11PL    ~(1 << 0)
#else
#define  MG4_6_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_6PL) || (G4_2PL == 0)
#define  MG4_6_12PL    ~(1 << 1)
#else
#define  MG4_6_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_6PL) || (G4_3PL == 0)
#define  MG4_6_13PL    ~(1 << 2)
#else
#define  MG4_6_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_6PL) || (G4_4PL == 0)
#define  MG4_6_14PL    ~(1 << 3)
#else
#define  MG4_6_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_6PL) || (G4_5PL == 0)
#define  MG4_6_15PL    ~(1 << 4)
#else
#define  MG4_6_15PL    0xFFFF
#endif

#if (G4_7PL >= G4_6PL) || (G4_7PL == 0)
#define  MG4_6_17PL    ~(1 << 6)
#else
#define  MG4_6_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_6PL) || (G4_8PL == 0)
#define  MG4_6_18PL    ~(1 << 7)
#else
#define  MG4_6_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_6PL) || (G4_9PL == 0)
#define  MG4_6_19PL    ~(1 << 8)
#else
#define  MG4_6_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_6PL) || (G4_10PL == 0)
#define  MG4_6_110PL    ~(1 << 9)
#else
#define  MG4_6_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_6PL) || (G4_11PL == 0)
#define  MG4_6_111PL    ~(1 << 10)
#else
#define  MG4_6_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_6PL) || (G4_12PL == 0)
#define  MG4_6_112PL    ~(1 << 11)
#else
#define  MG4_6_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_6PL) || (G4_13PL == 0)
#define  MG4_6_113PL    ~(1 << 12)
#else
#define  MG4_6_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_6PL) || (G4_14PL == 0)
#define  MG4_6_114PL    ~(1 << 13)
#else
#define  MG4_6_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_6PL) || (G4_15PL == 0)
#define  MG4_6_115PL    ~(1 << 14)
#else
#define  MG4_6_115PL    0xFFFF
#endif

