arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G5_5PL >= G5_9PL) || (G5_5PL == 0)
#define  MG5_9_15PL    ~(1 << 4)
#else
#define  MG5_9_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_9PL) || (G5_6PL == 0)
#define  MG5_9_16PL    ~(1 << 5)
#else
#define  MG5_9_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_9PL) || (G5_7PL == 0)
#define  MG5_9_17PL    ~(1 << 6)
#else
#define  MG5_9_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_9PL) || (G5_8PL == 0)
#define  MG5_9_18PL    ~(1 << 7)
#else
#define  MG5_9_18PL    0xFFFF
#endif

#if (G5_10PL >= G5_9PL) || (G5_10PL == 0)
#define  MG5_9_110PL    ~(1 << 9)
#else
#define  MG5_9_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_9PL) || (G5_11PL == 0)
#define  MG5_9_111PL    ~(1 << 10)
#else
#define  MG5_9_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_9PL) || (G5_12PL == 0)
#define  MG5_9_112PL    ~(1 << 11)
#else
#define  MG5_9_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_9PL) || (G5_13PL == 0)
#define  MG5_9_113PL    ~(1 << 12)
#else
#define  MG5_9_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_9PL) || (G5_14PL == 0)
#define  MG5_9_114PL    ~(1 << 13)
#else
#define  MG5_9_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_9PL) || (G5_15PL == 0)
#define  MG5_9_115PL    ~(1 << 14)
#else
#define  MG5_9_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_9PL) || (G5_16PL == 0)
#define  MG5_9_116PL    ~(1 << 15)
#else
#define  MG5_9_116PL    0xFFFF
#endif

#define  MG5_9_19PL	0xFEFF
#define  MG5_9    (MG5_9_11PL & MG5_9_12PL & MG5_9_13PL & MG5_9_14PL & \
                    MG5_9_15PL & MG5_9_16PL & MG5_9_17PL & MG5_9_18PL & \
                    MG5_9_19PL & MG5_9_110PL & MG5_9_111PL & MG5_9_112PL & \
                    MG5_9_113PL & MG5_9_114PL & MG5_9_115PL & MG5_9_116PL)
// End of MG5_9:
// Beginning of MG510:
#if (G5_1PL >= G5_10PL) || (G5_1PL == 0)
#define  MG5_10_11PL    ~(1 << 0)
#else
#define  MG5_10_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_10PL) || (G5_2PL == 0)
#define  MG5_10_12PL    ~(1 << 1)
#else
#define  MG5_10_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_10PL) || (G5_3PL == 0)
#define  MG5_10_13PL    ~(1 << 2)
#else
#define  MG5_10_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_10PL) || (G5_4PL == 0)
#define  MG5_10_14PL    ~(1 << 3)
#else
#define  MG5_10_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_10PL) || (G5_5PL == 0)
#define  MG5_10_15PL    ~(1 << 4)
#else
#define  MG5_10_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_10PL) || (G5_6PL == 0)
#define  MG5_10_16PL    ~(1 << 5)
#else
#define  MG5_10_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_10PL) || (G5_7PL == 0)
#define  MG5_10_17PL    ~(1 << 6)
#else
#define  MG5_10_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_10PL) || (G5_8PL == 0)
#define  MG5_10_18PL    ~(1 << 7)
#else
#define  MG5_10_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_10PL) || (G5_9PL == 0)
#define  MG5_10_19PL    ~(1 << 8)
#else
#define  MG5_10_19PL    0xFFFF
#endif

#if (G5_11PL >= G5_10PL) || (G5_11PL == 0)
#define  MG5_10_111PL    ~(1 << 10)
#else
#define  MG5_10_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_10PL) || (G5_12PL == 0)
#define  MG5_10_112PL    ~(1 << 11)
#else
#define  MG5_10_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_10PL) || (G5_13PL == 0)
#define  MG5_10_113PL    ~(1 << 12)
#else
#define  MG5_10_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_10PL) || (G5_14PL == 0)
#define  MG5_10_114PL    ~(1 << 13)
#else
#define  MG5_10_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_10PL) || (G5_15PL == 0)
#define  MG5_10_115PL    ~(1 << 14)
#else
#define  MG5_10_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_10PL) || (G5_16PL == 0)
#define  MG5_10_116PL    ~(1 << 15)
#else
#define  MG5_10_116PL    0xFFFF
#endif

#define  MG5_10_110PL	0xFDFF
#define  MG5_10    (MG5_10_11PL & MG5_10_12PL & MG5_10_13PL & MG5_10_14PL & \
                    MG5_10_15PL & MG5_10_16PL & MG5_10_17PL & MG5_10_18PL & \
                    MG5_10_19PL & MG5_10_110PL & MG5_10_111PL & MG5_10_112PL & \
                    MG5_10_113PL & MG5_10_114PL & MG5_10_115PL & MG5_10_116PL)
// End of MG5_10:
// Beginning of MG511:
#if (G5_1PL >= G5_11PL) || (G5_1PL == 0)
#define  MG5_11_11PL    ~(1 << 0)
#else
#define  MG5_11_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_11PL) || (G5_2PL == 0)
#define  MG5_11_12PL    ~(1 << 1)
#else
#define  MG5_11_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_11PL) || (G5_3PL == 0)
#define  MG5_11_13PL    ~(1 << 2)
#else
#define  MG5_11_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_11PL) || (G5_4PL == 0)
#define  MG5_11_14PL    ~(1 << 3)
#else
#define  MG5_11_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_11PL) || (G5_5PL == 0)
#define  MG5_11_15PL    ~(1 << 4)
#else
#define  MG5_11_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_11PL) || (G5_6PL == 0)
#define  MG5_11_16PL    ~(1 << 5)
#else
#define  MG5_11_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_11PL) || (G5_7PL == 0)
#define  MG5_11_17PL    ~(1 << 6)
#else
#define  MG5_11_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_11PL) || (G5_8PL == 0)
#define  MG5_11_18PL    ~(1 << 7)
#else
#define  MG5_11_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_11PL) || (G5_9PL == 0)
#define  MG5_11_19PL    ~(1 << 8)
#else
#define  MG5_11_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_11PL) || (G5_10PL == 0)
#define  MG5_11_110PL    ~(1 << 9)
#else
#define  MG5_11_110PL    0xFFFF
#endif

#if (G5_12PL >= G5_11PL) || (G5_12PL == 0)
#define  MG5_11_112PL    ~(1 << 11)
#else
#define  MG5_11_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_11PL) || (G5_13PL == 0)
#define  MG5_11_113PL    ~(1 << 12)
#else
#define  MG5_11_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_11PL) || (G5_14PL == 0)
#define  MG5_11_114PL    ~(1 << 13)
#else
#define  MG5_11_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_11PL) || (G5_15PL == 0)
#define  MG5_11_115PL    ~(1 << 14)
#else
#define  MG5_11_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_11PL) || (G5_16PL == 0)
#define  MG5_11_116PL    ~(1 << 15)
#else
#define  MG5_11_116PL    0xFFFF
#endif

#define  MG5_11_111PL	0xFBFF
#define  MG5_11    (MG5_11_11PL & MG5_11_12PL & MG5_11_13PL & MG5_11_14PL & \
                    MG5_11_15PL & MG5_11_16PL & MG5_11_17PL & MG5_11_18PL & \
                    MG5_11_19PL & MG5_11_110PL & MG5_11_111PL & MG5_11_112PL & \
                    MG5_11_113PL & MG5_11_114PL & MG5_11_115PL & MG5_11_116PL)
// End of MG5_11:
// Beginning of MG512:
#if (G5_1PL >= G5_12PL) || (G5_1PL == 0)
#define  MG5_12_11PL    ~(1 << 0)
#else
#define  MG5_12_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_12PL) || (G5_2PL == 0)
#define  MG5_12_12PL    ~(1 << 1)
#else
#define  MG5_12_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_12PL) || (G5_3PL == 0)
#define  MG5_12_13PL    ~(1 << 2)
#else
#define  MG5_12_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_12PL) || (G5_4PL == 0)
#define  MG5_12_14PL    ~(1 << 3)
#else
#define  MG5_12_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_12PL) || (G5_5PL == 0)
#define  MG5_12_15PL    ~(1 << 4)
#else
#define  MG5_12_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_12PL) || (G5_6PL == 0)
#define  MG5_12_16PL    ~(1 << 5)
#else
#define  MG5_12_16PL    0xFFFF
#endif

