arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G6_10PL >= G6_8PL) || (G6_10PL == 0)
#define  MG6_8_110PL    ~(1 << 9)
#else
#define  MG6_8_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_8PL) || (G6_11PL == 0)
#define  MG6_8_111PL    ~(1 << 10)
#else
#define  MG6_8_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_8PL) || (G6_12PL == 0)
#define  MG6_8_112PL    ~(1 << 11)
#else
#define  MG6_8_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_8PL) || (G6_13PL == 0)
#define  MG6_8_113PL    ~(1 << 12)
#else
#define  MG6_8_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_8PL) || (G6_14PL == 0)
#define  MG6_8_114PL    ~(1 << 13)
#else
#define  MG6_8_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_8PL) || (G6_15PL == 0)
#define  MG6_8_115PL    ~(1 << 14)
#else
#define  MG6_8_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_8PL) || (G6_16PL == 0)
#define  MG6_8_116PL    ~(1 << 15)
#else
#define  MG6_8_116PL    0xFFFF
#endif

#define  MG6_8_18PL	0xFF7F
#define  MG6_8    (MG6_8_11PL & MG6_8_12PL & MG6_8_13PL & MG6_8_14PL & \
                    MG6_8_15PL & MG6_8_16PL & MG6_8_17PL & MG6_8_18PL & \
                    MG6_8_19PL & MG6_8_110PL & MG6_8_111PL & MG6_8_112PL & \
                    MG6_8_113PL & MG6_8_114PL & MG6_8_115PL & MG6_8_116PL)
// End of MG6_8:
// Beginning of MG69:
#if (G6_1PL >= G6_9PL) || (G6_1PL == 0)
#define  MG6_9_11PL    ~(1 << 0)
#else
#define  MG6_9_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_9PL) || (G6_2PL == 0)
#define  MG6_9_12PL    ~(1 << 1)
#else
#define  MG6_9_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_9PL) || (G6_3PL == 0)
#define  MG6_9_13PL    ~(1 << 2)
#else
#define  MG6_9_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_9PL) || (G6_4PL == 0)
#define  MG6_9_14PL    ~(1 << 3)
#else
#define  MG6_9_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_9PL) || (G6_5PL == 0)
#define  MG6_9_15PL    ~(1 << 4)
#else
#define  MG6_9_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_9PL) || (G6_6PL == 0)
#define  MG6_9_16PL    ~(1 << 5)
#else
#define  MG6_9_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_9PL) || (G6_7PL == 0)
#define  MG6_9_17PL    ~(1 << 6)
#else
#define  MG6_9_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_9PL) || (G6_8PL == 0)
#define  MG6_9_18PL    ~(1 << 7)
#else
#define  MG6_9_18PL    0xFFFF
#endif

#if (G6_10PL >= G6_9PL) || (G6_10PL == 0)
#define  MG6_9_110PL    ~(1 << 9)
#else
#define  MG6_9_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_9PL) || (G6_11PL == 0)
#define  MG6_9_111PL    ~(1 << 10)
#else
#define  MG6_9_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_9PL) || (G6_12PL == 0)
#define  MG6_9_112PL    ~(1 << 11)
#else
#define  MG6_9_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_9PL) || (G6_13PL == 0)
#define  MG6_9_113PL    ~(1 << 12)
#else
#define  MG6_9_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_9PL) || (G6_14PL == 0)
#define  MG6_9_114PL    ~(1 << 13)
#else
#define  MG6_9_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_9PL) || (G6_15PL == 0)
#define  MG6_9_115PL    ~(1 << 14)
#else
#define  MG6_9_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_9PL) || (G6_16PL == 0)
#define  MG6_9_116PL    ~(1 << 15)
#else
#define  MG6_9_116PL    0xFFFF
#endif

#define  MG6_9_19PL	0xFEFF
#define  MG6_9    (MG6_9_11PL & MG6_9_12PL & MG6_9_13PL & MG6_9_14PL & \
                    MG6_9_15PL & MG6_9_16PL & MG6_9_17PL & MG6_9_18PL & \
                    MG6_9_19PL & MG6_9_110PL & MG6_9_111PL & MG6_9_112PL & \
                    MG6_9_113PL & MG6_9_114PL & MG6_9_115PL & MG6_9_116PL)
// End of MG6_9:
// Beginning of MG610:
#if (G6_1PL >= G6_10PL) || (G6_1PL == 0)
#define  MG6_10_11PL    ~(1 << 0)
#else
#define  MG6_10_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_10PL) || (G6_2PL == 0)
#define  MG6_10_12PL    ~(1 << 1)
#else
#define  MG6_10_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_10PL) || (G6_3PL == 0)
#define  MG6_10_13PL    ~(1 << 2)
#else
#define  MG6_10_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_10PL) || (G6_4PL == 0)
#define  MG6_10_14PL    ~(1 << 3)
#else
#define  MG6_10_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_10PL) || (G6_5PL == 0)
#define  MG6_10_15PL    ~(1 << 4)
#else
#define  MG6_10_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_10PL) || (G6_6PL == 0)
#define  MG6_10_16PL    ~(1 << 5)
#else
#define  MG6_10_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_10PL) || (G6_7PL == 0)
#define  MG6_10_17PL    ~(1 << 6)
#else
#define  MG6_10_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_10PL) || (G6_8PL == 0)
#define  MG6_10_18PL    ~(1 << 7)
#else
#define  MG6_10_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_10PL) || (G6_9PL == 0)
#define  MG6_10_19PL    ~(1 << 8)
#else
#define  MG6_10_19PL    0xFFFF
#endif

#if (G6_11PL >= G6_10PL) || (G6_11PL == 0)
#define  MG6_10_111PL    ~(1 << 10)
#else
#define  MG6_10_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_10PL) || (G6_12PL == 0)
#define  MG6_10_112PL    ~(1 << 11)
#else
#define  MG6_10_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_10PL) || (G6_13PL == 0)
#define  MG6_10_113PL    ~(1 << 12)
#else
#define  MG6_10_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_10PL) || (G6_14PL == 0)
#define  MG6_10_114PL    ~(1 << 13)
#else
#define  MG6_10_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_10PL) || (G6_15PL == 0)
#define  MG6_10_115PL    ~(1 << 14)
#else
#define  MG6_10_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_10PL) || (G6_16PL == 0)
#define  MG6_10_116PL    ~(1 << 15)
#else
#define  MG6_10_116PL    0xFFFF
#endif

#define  MG6_10_110PL	0xFDFF
#define  MG6_10    (MG6_10_11PL & MG6_10_12PL & MG6_10_13PL & MG6_10_14PL & \
                    MG6_10_15PL & MG6_10_16PL & MG6_10_17PL & MG6_10_18PL & \
                    MG6_10_19PL & MG6_10_110PL & MG6_10_111PL & MG6_10_112PL & \
                    MG6_10_113PL & MG6_10_114PL & MG6_10_115PL & MG6_10_116PL)
// End of MG6_10:
// Beginning of MG611:
#if (G6_1PL >= G6_11PL) || (G6_1PL == 0)
#define  MG6_11_11PL    ~(1 << 0)
#else
#define  MG6_11_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_11PL) || (G6_2PL == 0)
#define  MG6_11_12PL    ~(1 << 1)
#else
#define  MG6_11_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_11PL) || (G6_3PL == 0)
#define  MG6_11_13PL    ~(1 << 2)
#else
#define  MG6_11_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_11PL) || (G6_4PL == 0)
#define  MG6_11_14PL    ~(1 << 3)
#else
#define  MG6_11_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_11PL) || (G6_5PL == 0)
#define  MG6_11_15PL    ~(1 << 4)
#else
#define  MG6_11_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_11PL) || (G6_6PL == 0)
#define  MG6_11_16PL    ~(1 << 5)
#else
#define  MG6_11_16PL    0xFFFF
#endif

