arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G6_7PL >= G6_11PL) || (G6_7PL == 0)
#define  MG6_11_17PL    ~(1 << 6)
#else
#define  MG6_11_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_11PL) || (G6_8PL == 0)
#define  MG6_11_18PL    ~(1 << 7)
#else
#define  MG6_11_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_11PL) || (G6_9PL == 0)
#define  MG6_11_19PL    ~(1 << 8)
#else
#define  MG6_11_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_11PL) || (G6_10PL == 0)
#define  MG6_11_110PL    ~(1 << 9)
#else
#define  MG6_11_110PL    0xFFFF
#endif

#if (G6_12PL >= G6_11PL) || (G6_12PL == 0)
#define  MG6_11_112PL    ~(1 << 11)
#else
#define  MG6_11_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_11PL) || (G6_13PL == 0)
#define  MG6_11_113PL    ~(1 << 12)
#else
#define  MG6_11_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_11PL) || (G6_14PL == 0)
#define  MG6_11_114PL    ~(1 << 13)
#else
#define  MG6_11_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_11PL) || (G6_15PL == 0)
#define  MG6_11_115PL    ~(1 << 14)
#else
#define  MG6_11_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_11PL) || (G6_16PL == 0)
#define  MG6_11_116PL    ~(1 << 15)
#else
#define  MG6_11_116PL    0xFFFF
#endif

#define  MG6_11_111PL	0xFBFF
#define  MG6_11    (MG6_11_11PL & MG6_11_12PL & MG6_11_13PL & MG6_11_14PL & \
                    MG6_11_15PL & MG6_11_16PL & MG6_11_17PL & MG6_11_18PL & \
                    MG6_11_19PL & MG6_11_110PL & MG6_11_111PL & MG6_11_112PL & \
                    MG6_11_113PL & MG6_11_114PL & MG6_11_115PL & MG6_11_116PL)
// End of MG6_11:
// Beginning of MG612:
#if (G6_1PL >= G6_12PL) || (G6_1PL == 0)
#define  MG6_12_11PL    ~(1 << 0)
#else
#define  MG6_12_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_12PL) || (G6_2PL == 0)
#define  MG6_12_12PL    ~(1 << 1)
#else
#define  MG6_12_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_12PL) || (G6_3PL == 0)
#define  MG6_12_13PL    ~(1 << 2)
#else
#define  MG6_12_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_12PL) || (G6_4PL == 0)
#define  MG6_12_14PL    ~(1 << 3)
#else
#define  MG6_12_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_12PL) || (G6_5PL == 0)
#define  MG6_12_15PL    ~(1 << 4)
#else
#define  MG6_12_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_12PL) || (G6_6PL == 0)
#define  MG6_12_16PL    ~(1 << 5)
#else
#define  MG6_12_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_12PL) || (G6_7PL == 0)
#define  MG6_12_17PL    ~(1 << 6)
#else
#define  MG6_12_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_12PL) || (G6_8PL == 0)
#define  MG6_12_18PL    ~(1 << 7)
#else
#define  MG6_12_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_12PL) || (G6_9PL == 0)
#define  MG6_12_19PL    ~(1 << 8)
#else
#define  MG6_12_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_12PL) || (G6_10PL == 0)
#define  MG6_12_110PL    ~(1 << 9)
#else
#define  MG6_12_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_12PL) || (G6_11PL == 0)
#define  MG6_12_111PL    ~(1 << 10)
#else
#define  MG6_12_111PL    0xFFFF
#endif

#if (G6_13PL >= G6_12PL) || (G6_13PL == 0)
#define  MG6_12_113PL    ~(1 << 12)
#else
#define  MG6_12_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_12PL) || (G6_14PL == 0)
#define  MG6_12_114PL    ~(1 << 13)
#else
#define  MG6_12_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_12PL) || (G6_15PL == 0)
#define  MG6_12_115PL    ~(1 << 14)
#else
#define  MG6_12_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_12PL) || (G6_16PL == 0)
#define  MG6_12_116PL    ~(1 << 15)
#else
#define  MG6_12_116PL    0xFFFF
#endif

#define  MG6_12_112PL	0xF7FF
#define  MG6_12    (MG6_12_11PL & MG6_12_12PL & MG6_12_13PL & MG6_12_14PL & \
                    MG6_12_15PL & MG6_12_16PL & MG6_12_17PL & MG6_12_18PL & \
                    MG6_12_19PL & MG6_12_110PL & MG6_12_111PL & MG6_12_112PL & \
                    MG6_12_113PL & MG6_12_114PL & MG6_12_115PL & MG6_12_116PL)
// End of MG6_12:
// Beginning of MG613:
#if (G6_1PL >= G6_13PL) || (G6_1PL == 0)
#define  MG6_13_11PL    ~(1 << 0)
#else
#define  MG6_13_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_13PL) || (G6_2PL == 0)
#define  MG6_13_12PL    ~(1 << 1)
#else
#define  MG6_13_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_13PL) || (G6_3PL == 0)
#define  MG6_13_13PL    ~(1 << 2)
#else
#define  MG6_13_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_13PL) || (G6_4PL == 0)
#define  MG6_13_14PL    ~(1 << 3)
#else
#define  MG6_13_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_13PL) || (G6_5PL == 0)
#define  MG6_13_15PL    ~(1 << 4)
#else
#define  MG6_13_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_13PL) || (G6_6PL == 0)
#define  MG6_13_16PL    ~(1 << 5)
#else
#define  MG6_13_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_13PL) || (G6_7PL == 0)
#define  MG6_13_17PL    ~(1 << 6)
#else
#define  MG6_13_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_13PL) || (G6_8PL == 0)
#define  MG6_13_18PL    ~(1 << 7)
#else
#define  MG6_13_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_13PL) || (G6_9PL == 0)
#define  MG6_13_19PL    ~(1 << 8)
#else
#define  MG6_13_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_13PL) || (G6_10PL == 0)
#define  MG6_13_110PL    ~(1 << 9)
#else
#define  MG6_13_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_13PL) || (G6_11PL == 0)
#define  MG6_13_111PL    ~(1 << 10)
#else
#define  MG6_13_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_13PL) || (G6_12PL == 0)
#define  MG6_13_112PL    ~(1 << 11)
#else
#define  MG6_13_112PL    0xFFFF
#endif

#if (G6_14PL >= G6_13PL) || (G6_14PL == 0)
#define  MG6_13_114PL    ~(1 << 13)
#else
#define  MG6_13_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_13PL) || (G6_15PL == 0)
#define  MG6_13_115PL    ~(1 << 14)
#else
#define  MG6_13_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_13PL) || (G6_16PL == 0)
#define  MG6_13_116PL    ~(1 << 15)
#else
#define  MG6_13_116PL    0xFFFF
#endif

#define  MG6_13_113PL	0xEFFF
#define  MG6_13    (MG6_13_11PL & MG6_13_12PL & MG6_13_13PL & MG6_13_14PL & \
                    MG6_13_15PL & MG6_13_16PL & MG6_13_17PL & MG6_13_18PL & \
                    MG6_13_19PL & MG6_13_110PL & MG6_13_111PL & MG6_13_112PL & \
                    MG6_13_113PL & MG6_13_114PL & MG6_13_115PL & MG6_13_116PL)
// End of MG6_13:
// Beginning of MG614:
#if (G6_1PL >= G6_14PL) || (G6_1PL == 0)
#define  MG6_14_11PL    ~(1 << 0)
#else
#define  MG6_14_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_14PL) || (G6_2PL == 0)
#define  MG6_14_12PL    ~(1 << 1)
#else
#define  MG6_14_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_14PL) || (G6_3PL == 0)
#define  MG6_14_13PL    ~(1 << 2)
#else
#define  MG6_14_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_14PL) || (G6_4PL == 0)
#define  MG6_14_14PL    ~(1 << 3)
#else
#define  MG6_14_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_14PL) || (G6_5PL == 0)
#define  MG6_14_15PL    ~(1 << 4)
#else
#define  MG6_14_15PL    0xFFFF
#endif

