arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G7_3PL >= G7_1PL) || (G7_3PL == 0)
#define  MG7_1_13PL    ~(1 << 2)
#else
#define  MG7_1_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_1PL) || (G7_4PL == 0)
#define  MG7_1_14PL    ~(1 << 3)
#else
#define  MG7_1_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_1PL) || (G7_5PL == 0)
#define  MG7_1_15PL    ~(1 << 4)
#else
#define  MG7_1_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_1PL) || (G7_6PL == 0)
#define  MG7_1_16PL    ~(1 << 5)
#else
#define  MG7_1_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_1PL) || (G7_7PL == 0)
#define  MG7_1_17PL    ~(1 << 6)
#else
#define  MG7_1_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_1PL) || (G7_8PL == 0)
#define  MG7_1_18PL    ~(1 << 7)
#else
#define  MG7_1_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_1PL) || (G7_9PL == 0)
#define  MG7_1_19PL    ~(1 << 8)
#else
#define  MG7_1_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_1PL) || (G7_10PL == 0)
#define  MG7_1_110PL    ~(1 << 9)
#else
#define  MG7_1_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_1PL) || (G7_11PL == 0)
#define  MG7_1_111PL    ~(1 << 10)
#else
#define  MG7_1_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_1PL) || (G7_12PL == 0)
#define  MG7_1_112PL    ~(1 << 11)
#else
#define  MG7_1_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_1PL) || (G7_13PL == 0)
#define  MG7_1_113PL    ~(1 << 12)
#else
#define  MG7_1_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_1PL) || (G7_14PL == 0)
#define  MG7_1_114PL    ~(1 << 13)
#else
#define  MG7_1_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_1PL) || (G7_15PL == 0)
#define  MG7_1_115PL    ~(1 << 14)
#else
#define  MG7_1_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_1PL) || (G7_16PL == 0)
#define  MG7_1_116PL    ~(1 << 15)
#else
#define  MG7_1_116PL    0xFFFF
#endif

#define  MG7_1_11PL	0xFFFE
#define  MG7_1    (MG7_1_11PL & MG7_1_12PL & MG7_1_13PL & MG7_1_14PL & \
                    MG7_1_15PL & MG7_1_16PL & MG7_1_17PL & MG7_1_18PL & \
                    MG7_1_19PL & MG7_1_110PL & MG7_1_111PL & MG7_1_112PL & \
                    MG7_1_113PL & MG7_1_114PL & MG7_1_115PL & MG7_1_116PL)
// End of MG7_1:
// Beginning of MG72:
#if (G7_1PL >= G7_2PL) || (G7_1PL == 0)
#define  MG7_2_11PL    ~(1 << 0)
#else
#define  MG7_2_11PL    0xFFFF
#endif

#if (G7_3PL >= G7_2PL) || (G7_3PL == 0)
#define  MG7_2_13PL    ~(1 << 2)
#else
#define  MG7_2_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_2PL) || (G7_4PL == 0)
#define  MG7_2_14PL    ~(1 << 3)
#else
#define  MG7_2_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_2PL) || (G7_5PL == 0)
#define  MG7_2_15PL    ~(1 << 4)
#else
#define  MG7_2_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_2PL) || (G7_6PL == 0)
#define  MG7_2_16PL    ~(1 << 5)
#else
#define  MG7_2_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_2PL) || (G7_7PL == 0)
#define  MG7_2_17PL    ~(1 << 6)
#else
#define  MG7_2_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_2PL) || (G7_8PL == 0)
#define  MG7_2_18PL    ~(1 << 7)
#else
#define  MG7_2_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_2PL) || (G7_9PL == 0)
#define  MG7_2_19PL    ~(1 << 8)
#else
#define  MG7_2_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_2PL) || (G7_10PL == 0)
#define  MG7_2_110PL    ~(1 << 9)
#else
#define  MG7_2_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_2PL) || (G7_11PL == 0)
#define  MG7_2_111PL    ~(1 << 10)
#else
#define  MG7_2_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_2PL) || (G7_12PL == 0)
#define  MG7_2_112PL    ~(1 << 11)
#else
#define  MG7_2_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_2PL) || (G7_13PL == 0)
#define  MG7_2_113PL    ~(1 << 12)
#else
#define  MG7_2_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_2PL) || (G7_14PL == 0)
#define  MG7_2_114PL    ~(1 << 13)
#else
#define  MG7_2_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_2PL) || (G7_15PL == 0)
#define  MG7_2_115PL    ~(1 << 14)
#else
#define  MG7_2_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_2PL) || (G7_16PL == 0)
#define  MG7_2_116PL    ~(1 << 15)
#else
#define  MG7_2_116PL    0xFFFF
#endif

#define  MG7_2_12PL	0xFFFD
#define  MG7_2    (MG7_2_11PL & MG7_2_12PL & MG7_2_13PL & MG7_2_14PL & \
                    MG7_2_15PL & MG7_2_16PL & MG7_2_17PL & MG7_2_18PL & \
                    MG7_2_19PL & MG7_2_110PL & MG7_2_111PL & MG7_2_112PL & \
                    MG7_2_113PL & MG7_2_114PL & MG7_2_115PL & MG7_2_116PL)
// End of MG7_2:
// Beginning of MG73:
#if (G7_1PL >= G7_3PL) || (G7_1PL == 0)
#define  MG7_3_11PL    ~(1 << 0)
#else
#define  MG7_3_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_3PL) || (G7_2PL == 0)
#define  MG7_3_12PL    ~(1 << 1)
#else
#define  MG7_3_12PL    0xFFFF
#endif

#if (G7_4PL >= G7_3PL) || (G7_4PL == 0)
#define  MG7_3_14PL    ~(1 << 3)
#else
#define  MG7_3_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_3PL) || (G7_5PL == 0)
#define  MG7_3_15PL    ~(1 << 4)
#else
#define  MG7_3_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_3PL) || (G7_6PL == 0)
#define  MG7_3_16PL    ~(1 << 5)
#else
#define  MG7_3_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_3PL) || (G7_7PL == 0)
#define  MG7_3_17PL    ~(1 << 6)
#else
#define  MG7_3_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_3PL) || (G7_8PL == 0)
#define  MG7_3_18PL    ~(1 << 7)
#else
#define  MG7_3_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_3PL) || (G7_9PL == 0)
#define  MG7_3_19PL    ~(1 << 8)
#else
#define  MG7_3_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_3PL) || (G7_10PL == 0)
#define  MG7_3_110PL    ~(1 << 9)
#else
#define  MG7_3_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_3PL) || (G7_11PL == 0)
#define  MG7_3_111PL    ~(1 << 10)
#else
#define  MG7_3_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_3PL) || (G7_12PL == 0)
#define  MG7_3_112PL    ~(1 << 11)
#else
#define  MG7_3_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_3PL) || (G7_13PL == 0)
#define  MG7_3_113PL    ~(1 << 12)
#else
#define  MG7_3_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_3PL) || (G7_14PL == 0)
#define  MG7_3_114PL    ~(1 << 13)
#else
#define  MG7_3_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_3PL) || (G7_15PL == 0)
#define  MG7_3_115PL    ~(1 << 14)
#else
#define  MG7_3_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_3PL) || (G7_16PL == 0)
#define  MG7_3_116PL    ~(1 << 15)
#else
#define  MG7_3_116PL    0xFFFF
#endif

#define  MG7_3_13PL	0xFFFB
#define  MG7_3    (MG7_3_11PL & MG7_3_12PL & MG7_3_13PL & MG7_3_14PL & \
                    MG7_3_15PL & MG7_3_16PL & MG7_3_17PL & MG7_3_18PL & \
                    MG7_3_19PL & MG7_3_110PL & MG7_3_111PL & MG7_3_112PL & \
                    MG7_3_113PL & MG7_3_114PL & MG7_3_115PL & MG7_3_116PL)
// End of MG7_3:
// Beginning of MG74:
#if (G7_1PL >= G7_4PL) || (G7_1PL == 0)
#define  MG7_4_11PL    ~(1 << 0)
#else
#define  MG7_4_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_4PL) || (G7_2PL == 0)
#define  MG7_4_12PL    ~(1 << 1)
#else
#define  MG7_4_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_4PL) || (G7_3PL == 0)
#define  MG7_4_13PL    ~(1 << 2)
#else
#define  MG7_4_13PL    0xFFFF
#endif

#if (G7_5PL >= G7_4PL) || (G7_5PL == 0)
#define  MG7_4_15PL    ~(1 << 4)
#else
#define  MG7_4_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_4PL) || (G7_6PL == 0)
#define  MG7_4_16PL    ~(1 << 5)
#else
#define  MG7_4_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_4PL) || (G7_7PL == 0)
#define  MG7_4_17PL    ~(1 << 6)
#else
#define  MG7_4_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_4PL) || (G7_8PL == 0)
#define  MG7_4_18PL    ~(1 << 7)
#else
#define  MG7_4_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_4PL) || (G7_9PL == 0)
#define  MG7_4_19PL    ~(1 << 8)
#else
#define  MG7_4_19PL    0xFFFF
#endif

