arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G7_5PL >= G7_10PL) || (G7_5PL == 0)
#define  MG7_10_15PL    ~(1 << 4)
#else
#define  MG7_10_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_10PL) || (G7_6PL == 0)
#define  MG7_10_16PL    ~(1 << 5)
#else
#define  MG7_10_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_10PL) || (G7_7PL == 0)
#define  MG7_10_17PL    ~(1 << 6)
#else
#define  MG7_10_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_10PL) || (G7_8PL == 0)
#define  MG7_10_18PL    ~(1 << 7)
#else
#define  MG7_10_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_10PL) || (G7_9PL == 0)
#define  MG7_10_19PL    ~(1 << 8)
#else
#define  MG7_10_19PL    0xFFFF
#endif

#if (G7_11PL >= G7_10PL) || (G7_11PL == 0)
#define  MG7_10_111PL    ~(1 << 10)
#else
#define  MG7_10_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_10PL) || (G7_12PL == 0)
#define  MG7_10_112PL    ~(1 << 11)
#else
#define  MG7_10_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_10PL) || (G7_13PL == 0)
#define  MG7_10_113PL    ~(1 << 12)
#else
#define  MG7_10_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_10PL) || (G7_14PL == 0)
#define  MG7_10_114PL    ~(1 << 13)
#else
#define  MG7_10_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_10PL) || (G7_15PL == 0)
#define  MG7_10_115PL    ~(1 << 14)
#else
#define  MG7_10_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_10PL) || (G7_16PL == 0)
#define  MG7_10_116PL    ~(1 << 15)
#else
#define  MG7_10_116PL    0xFFFF
#endif

#define  MG7_10_110PL	0xFDFF
#define  MG7_10    (MG7_10_11PL & MG7_10_12PL & MG7_10_13PL & MG7_10_14PL & \
                    MG7_10_15PL & MG7_10_16PL & MG7_10_17PL & MG7_10_18PL & \
                    MG7_10_19PL & MG7_10_110PL & MG7_10_111PL & MG7_10_112PL & \
                    MG7_10_113PL & MG7_10_114PL & MG7_10_115PL & MG7_10_116PL)
// End of MG7_10:
// Beginning of MG711:
#if (G7_1PL >= G7_11PL) || (G7_1PL == 0)
#define  MG7_11_11PL    ~(1 << 0)
#else
#define  MG7_11_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_11PL) || (G7_2PL == 0)
#define  MG7_11_12PL    ~(1 << 1)
#else
#define  MG7_11_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_11PL) || (G7_3PL == 0)
#define  MG7_11_13PL    ~(1 << 2)
#else
#define  MG7_11_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_11PL) || (G7_4PL == 0)
#define  MG7_11_14PL    ~(1 << 3)
#else
#define  MG7_11_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_11PL) || (G7_5PL == 0)
#define  MG7_11_15PL    ~(1 << 4)
#else
#define  MG7_11_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_11PL) || (G7_6PL == 0)
#define  MG7_11_16PL    ~(1 << 5)
#else
#define  MG7_11_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_11PL) || (G7_7PL == 0)
#define  MG7_11_17PL    ~(1 << 6)
#else
#define  MG7_11_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_11PL) || (G7_8PL == 0)
#define  MG7_11_18PL    ~(1 << 7)
#else
#define  MG7_11_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_11PL) || (G7_9PL == 0)
#define  MG7_11_19PL    ~(1 << 8)
#else
#define  MG7_11_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_11PL) || (G7_10PL == 0)
#define  MG7_11_110PL    ~(1 << 9)
#else
#define  MG7_11_110PL    0xFFFF
#endif

#if (G7_12PL >= G7_11PL) || (G7_12PL == 0)
#define  MG7_11_112PL    ~(1 << 11)
#else
#define  MG7_11_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_11PL) || (G7_13PL == 0)
#define  MG7_11_113PL    ~(1 << 12)
#else
#define  MG7_11_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_11PL) || (G7_14PL == 0)
#define  MG7_11_114PL    ~(1 << 13)
#else
#define  MG7_11_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_11PL) || (G7_15PL == 0)
#define  MG7_11_115PL    ~(1 << 14)
#else
#define  MG7_11_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_11PL) || (G7_16PL == 0)
#define  MG7_11_116PL    ~(1 << 15)
#else
#define  MG7_11_116PL    0xFFFF
#endif

#define  MG7_11_111PL	0xFBFF
#define  MG7_11    (MG7_11_11PL & MG7_11_12PL & MG7_11_13PL & MG7_11_14PL & \
                    MG7_11_15PL & MG7_11_16PL & MG7_11_17PL & MG7_11_18PL & \
                    MG7_11_19PL & MG7_11_110PL & MG7_11_111PL & MG7_11_112PL & \
                    MG7_11_113PL & MG7_11_114PL & MG7_11_115PL & MG7_11_116PL)
// End of MG7_11:
// Beginning of MG712:
#if (G7_1PL >= G7_12PL) || (G7_1PL == 0)
#define  MG7_12_11PL    ~(1 << 0)
#else
#define  MG7_12_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_12PL) || (G7_2PL == 0)
#define  MG7_12_12PL    ~(1 << 1)
#else
#define  MG7_12_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_12PL) || (G7_3PL == 0)
#define  MG7_12_13PL    ~(1 << 2)
#else
#define  MG7_12_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_12PL) || (G7_4PL == 0)
#define  MG7_12_14PL    ~(1 << 3)
#else
#define  MG7_12_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_12PL) || (G7_5PL == 0)
#define  MG7_12_15PL    ~(1 << 4)
#else
#define  MG7_12_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_12PL) || (G7_6PL == 0)
#define  MG7_12_16PL    ~(1 << 5)
#else
#define  MG7_12_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_12PL) || (G7_7PL == 0)
#define  MG7_12_17PL    ~(1 << 6)
#else
#define  MG7_12_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_12PL) || (G7_8PL == 0)
#define  MG7_12_18PL    ~(1 << 7)
#else
#define  MG7_12_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_12PL) || (G7_9PL == 0)
#define  MG7_12_19PL    ~(1 << 8)
#else
#define  MG7_12_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_12PL) || (G7_10PL == 0)
#define  MG7_12_110PL    ~(1 << 9)
#else
#define  MG7_12_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_12PL) || (G7_11PL == 0)
#define  MG7_12_111PL    ~(1 << 10)
#else
#define  MG7_12_111PL    0xFFFF
#endif

#if (G7_13PL >= G7_12PL) || (G7_13PL == 0)
#define  MG7_12_113PL    ~(1 << 12)
#else
#define  MG7_12_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_12PL) || (G7_14PL == 0)
#define  MG7_12_114PL    ~(1 << 13)
#else
#define  MG7_12_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_12PL) || (G7_15PL == 0)
#define  MG7_12_115PL    ~(1 << 14)
#else
#define  MG7_12_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_12PL) || (G7_16PL == 0)
#define  MG7_12_116PL    ~(1 << 15)
#else
#define  MG7_12_116PL    0xFFFF
#endif

#define  MG7_12_112PL	0xF7FF
#define  MG7_12    (MG7_12_11PL & MG7_12_12PL & MG7_12_13PL & MG7_12_14PL & \
                    MG7_12_15PL & MG7_12_16PL & MG7_12_17PL & MG7_12_18PL & \
                    MG7_12_19PL & MG7_12_110PL & MG7_12_111PL & MG7_12_112PL & \
                    MG7_12_113PL & MG7_12_114PL & MG7_12_115PL & MG7_12_116PL)
// End of MG7_12:
// Beginning of MG713:
#if (G7_1PL >= G7_13PL) || (G7_1PL == 0)
#define  MG7_13_11PL    ~(1 << 0)
#else
#define  MG7_13_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_13PL) || (G7_2PL == 0)
#define  MG7_13_12PL    ~(1 << 1)
#else
#define  MG7_13_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_13PL) || (G7_3PL == 0)
#define  MG7_13_13PL    ~(1 << 2)
#else
#define  MG7_13_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_13PL) || (G7_4PL == 0)
#define  MG7_13_14PL    ~(1 << 3)
#else
#define  MG7_13_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_13PL) || (G7_5PL == 0)
#define  MG7_13_15PL    ~(1 << 4)
#else
#define  MG7_13_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_13PL) || (G7_6PL == 0)
#define  MG7_13_16PL    ~(1 << 5)
#else
#define  MG7_13_16PL    0xFFFF
#endif

