arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G12_2PL >= G12_6PL) || (G12_2PL == 0)
#define  MG12_6_12PL    ~(1 << 1)
#else
#define  MG12_6_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_6PL) || (G12_3PL == 0)
#define  MG12_6_13PL    ~(1 << 2)
#else
#define  MG12_6_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_6PL) || (G12_4PL == 0)
#define  MG12_6_14PL    ~(1 << 3)
#else
#define  MG12_6_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_6PL) || (G12_5PL == 0)
#define  MG12_6_15PL    ~(1 << 4)
#else
#define  MG12_6_15PL    0xFFFF
#endif

#if (G12_7PL >= G12_6PL) || (G12_7PL == 0)
#define  MG12_6_17PL    ~(1 << 6)
#else
#define  MG12_6_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_6PL) || (G12_8PL == 0)
#define  MG12_6_18PL    ~(1 << 7)
#else
#define  MG12_6_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_6PL) || (G12_9PL == 0)
#define  MG12_6_19PL    ~(1 << 8)
#else
#define  MG12_6_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_6PL) || (G12_10PL == 0)
#define  MG12_6_110PL    ~(1 << 9)
#else
#define  MG12_6_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_6PL) || (G12_11PL == 0)
#define  MG12_6_111PL    ~(1 << 10)
#else
#define  MG12_6_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_6PL) || (G12_12PL == 0)
#define  MG12_6_112PL    ~(1 << 11)
#else
#define  MG12_6_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_6PL) || (G12_13PL == 0)
#define  MG12_6_113PL    ~(1 << 12)
#else
#define  MG12_6_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_6PL) || (G12_14PL == 0)
#define  MG12_6_114PL    ~(1 << 13)
#else
#define  MG12_6_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_6PL) || (G12_15PL == 0)
#define  MG12_6_115PL    ~(1 << 14)
#else
#define  MG12_6_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_6PL) || (G12_16PL == 0)
#define  MG12_6_116PL    ~(1 << 15)
#else
#define  MG12_6_116PL    0xFFFF
#endif

#define  MG12_6_16PL	0xFFDF
#define  MG12_6    (MG12_6_11PL & MG12_6_12PL & MG12_6_13PL & MG12_6_14PL & \
                    MG12_6_15PL & MG12_6_16PL & MG12_6_17PL & MG12_6_18PL & \
                    MG12_6_19PL & MG12_6_110PL & MG12_6_111PL & MG12_6_112PL & \
                    MG12_6_113PL & MG12_6_114PL & MG12_6_115PL & MG12_6_116PL)
// End of MG12_6:
// Beginning of MG127:
#if (G12_1PL >= G12_7PL) || (G12_1PL == 0)
#define  MG12_7_11PL    ~(1 << 0)
#else
#define  MG12_7_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_7PL) || (G12_2PL == 0)
#define  MG12_7_12PL    ~(1 << 1)
#else
#define  MG12_7_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_7PL) || (G12_3PL == 0)
#define  MG12_7_13PL    ~(1 << 2)
#else
#define  MG12_7_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_7PL) || (G12_4PL == 0)
#define  MG12_7_14PL    ~(1 << 3)
#else
#define  MG12_7_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_7PL) || (G12_5PL == 0)
#define  MG12_7_15PL    ~(1 << 4)
#else
#define  MG12_7_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_7PL) || (G12_6PL == 0)
#define  MG12_7_16PL    ~(1 << 5)
#else
#define  MG12_7_16PL    0xFFFF
#endif

#if (G12_8PL >= G12_7PL) || (G12_8PL == 0)
#define  MG12_7_18PL    ~(1 << 7)
#else
#define  MG12_7_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_7PL) || (G12_9PL == 0)
#define  MG12_7_19PL    ~(1 << 8)
#else
#define  MG12_7_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_7PL) || (G12_10PL == 0)
#define  MG12_7_110PL    ~(1 << 9)
#else
#define  MG12_7_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_7PL) || (G12_11PL == 0)
#define  MG12_7_111PL    ~(1 << 10)
#else
#define  MG12_7_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_7PL) || (G12_12PL == 0)
#define  MG12_7_112PL    ~(1 << 11)
#else
#define  MG12_7_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_7PL) || (G12_13PL == 0)
#define  MG12_7_113PL    ~(1 << 12)
#else
#define  MG12_7_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_7PL) || (G12_14PL == 0)
#define  MG12_7_114PL    ~(1 << 13)
#else
#define  MG12_7_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_7PL) || (G12_15PL == 0)
#define  MG12_7_115PL    ~(1 << 14)
#else
#define  MG12_7_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_7PL) || (G12_16PL == 0)
#define  MG12_7_116PL    ~(1 << 15)
#else
#define  MG12_7_116PL    0xFFFF
#endif

#define  MG12_7_17PL	0xFFBF
#define  MG12_7    (MG12_7_11PL & MG12_7_12PL & MG12_7_13PL & MG12_7_14PL & \
                    MG12_7_15PL & MG12_7_16PL & MG12_7_17PL & MG12_7_18PL & \
                    MG12_7_19PL & MG12_7_110PL & MG12_7_111PL & MG12_7_112PL & \
                    MG12_7_113PL & MG12_7_114PL & MG12_7_115PL & MG12_7_116PL)
// End of MG12_7:
// Beginning of MG128:
#if (G12_1PL >= G12_8PL) || (G12_1PL == 0)
#define  MG12_8_11PL    ~(1 << 0)
#else
#define  MG12_8_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_8PL) || (G12_2PL == 0)
#define  MG12_8_12PL    ~(1 << 1)
#else
#define  MG12_8_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_8PL) || (G12_3PL == 0)
#define  MG12_8_13PL    ~(1 << 2)
#else
#define  MG12_8_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_8PL) || (G12_4PL == 0)
#define  MG12_8_14PL    ~(1 << 3)
#else
#define  MG12_8_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_8PL) || (G12_5PL == 0)
#define  MG12_8_15PL    ~(1 << 4)
#else
#define  MG12_8_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_8PL) || (G12_6PL == 0)
#define  MG12_8_16PL    ~(1 << 5)
#else
#define  MG12_8_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_8PL) || (G12_7PL == 0)
#define  MG12_8_17PL    ~(1 << 6)
#else
#define  MG12_8_17PL    0xFFFF
#endif

#if (G12_9PL >= G12_8PL) || (G12_9PL == 0)
#define  MG12_8_19PL    ~(1 << 8)
#else
#define  MG12_8_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_8PL) || (G12_10PL == 0)
#define  MG12_8_110PL    ~(1 << 9)
#else
#define  MG12_8_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_8PL) || (G12_11PL == 0)
#define  MG12_8_111PL    ~(1 << 10)
#else
#define  MG12_8_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_8PL) || (G12_12PL == 0)
#define  MG12_8_112PL    ~(1 << 11)
#else
#define  MG12_8_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_8PL) || (G12_13PL == 0)
#define  MG12_8_113PL    ~(1 << 12)
#else
#define  MG12_8_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_8PL) || (G12_14PL == 0)
#define  MG12_8_114PL    ~(1 << 13)
#else
#define  MG12_8_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_8PL) || (G12_15PL == 0)
#define  MG12_8_115PL    ~(1 << 14)
#else
#define  MG12_8_115PL    0xFFFF
#endif

