arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/include/F2837xS_SWPrioritizedIsrLevels.h
#if (G12_7PL >= G12_14PL) || (G12_7PL == 0)
#define  MG12_14_17PL    ~(1 << 6)
#else
#define  MG12_14_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_14PL) || (G12_8PL == 0)
#define  MG12_14_18PL    ~(1 << 7)
#else
#define  MG12_14_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_14PL) || (G12_9PL == 0)
#define  MG12_14_19PL    ~(1 << 8)
#else
#define  MG12_14_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_14PL) || (G12_10PL == 0)
#define  MG12_14_110PL    ~(1 << 9)
#else
#define  MG12_14_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_14PL) || (G12_11PL == 0)
#define  MG12_14_111PL    ~(1 << 10)
#else
#define  MG12_14_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_14PL) || (G12_12PL == 0)
#define  MG12_14_112PL    ~(1 << 11)
#else
#define  MG12_14_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_14PL) || (G12_13PL == 0)
#define  MG12_14_113PL    ~(1 << 12)
#else
#define  MG12_14_113PL    0xFFFF
#endif

#if (G12_15PL >= G12_14PL) || (G12_15PL == 0)
#define  MG12_14_115PL    ~(1 << 14)
#else
#define  MG12_14_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_14PL) || (G12_16PL == 0)
#define  MG12_14_116PL    ~(1 << 15)
#else
#define  MG12_14_116PL    0xFFFF
#endif

#define  MG12_14_114PL	0xDFFF
#define  MG12_14    (MG12_14_11PL & MG12_14_12PL & MG12_14_13PL & MG12_14_14PL & \
                    MG12_14_15PL & MG12_14_16PL & MG12_14_17PL & MG12_14_18PL & \
                    MG12_14_19PL & MG12_14_110PL & MG12_14_111PL & MG12_14_112PL & \
                    MG12_14_113PL & MG12_14_114PL & MG12_14_115PL & MG12_14_116PL)
// End of MG12_14:
// Beginning of MG1215:
#if (G12_1PL >= G12_15PL) || (G12_1PL == 0)
#define  MG12_15_11PL    ~(1 << 0)
#else
#define  MG12_15_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_15PL) || (G12_2PL == 0)
#define  MG12_15_12PL    ~(1 << 1)
#else
#define  MG12_15_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_15PL) || (G12_3PL == 0)
#define  MG12_15_13PL    ~(1 << 2)
#else
#define  MG12_15_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_15PL) || (G12_4PL == 0)
#define  MG12_15_14PL    ~(1 << 3)
#else
#define  MG12_15_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_15PL) || (G12_5PL == 0)
#define  MG12_15_15PL    ~(1 << 4)
#else
#define  MG12_15_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_15PL) || (G12_6PL == 0)
#define  MG12_15_16PL    ~(1 << 5)
#else
#define  MG12_15_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_15PL) || (G12_7PL == 0)
#define  MG12_15_17PL    ~(1 << 6)
#else
#define  MG12_15_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_15PL) || (G12_8PL == 0)
#define  MG12_15_18PL    ~(1 << 7)
#else
#define  MG12_15_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_15PL) || (G12_9PL == 0)
#define  MG12_15_19PL    ~(1 << 8)
#else
#define  MG12_15_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_15PL) || (G12_10PL == 0)
#define  MG12_15_110PL    ~(1 << 9)
#else
#define  MG12_15_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_15PL) || (G12_11PL == 0)
#define  MG12_15_111PL    ~(1 << 10)
#else
#define  MG12_15_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_15PL) || (G12_12PL == 0)
#define  MG12_15_112PL    ~(1 << 11)
#else
#define  MG12_15_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_15PL) || (G12_13PL == 0)
#define  MG12_15_113PL    ~(1 << 12)
#else
#define  MG12_15_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_15PL) || (G12_14PL == 0)
#define  MG12_15_114PL    ~(1 << 13)
#else
#define  MG12_15_114PL    0xFFFF
#endif

#if (G12_16PL >= G12_15PL) || (G12_16PL == 0)
#define  MG12_15_116PL    ~(1 << 15)
#else
#define  MG12_15_116PL    0xFFFF
#endif

#define  MG12_15_115PL	0xBFFF
#define  MG12_15    (MG12_15_11PL & MG12_15_12PL & MG12_15_13PL & MG12_15_14PL & \
                    MG12_15_15PL & MG12_15_16PL & MG12_15_17PL & MG12_15_18PL & \
                    MG12_15_19PL & MG12_15_110PL & MG12_15_111PL & MG12_15_112PL & \
                    MG12_15_113PL & MG12_15_114PL & MG12_15_115PL & MG12_15_116PL)
// End of MG12_15:
// Beginning of MG1216:
#if (G12_1PL >= G12_16PL) || (G12_1PL == 0)
#define  MG12_16_11PL    ~(1 << 0)
#else
#define  MG12_16_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_16PL) || (G12_2PL == 0)
#define  MG12_16_12PL    ~(1 << 1)
#else
#define  MG12_16_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_16PL) || (G12_3PL == 0)
#define  MG12_16_13PL    ~(1 << 2)
#else
#define  MG12_16_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_16PL) || (G12_4PL == 0)
#define  MG12_16_14PL    ~(1 << 3)
#else
#define  MG12_16_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_16PL) || (G12_5PL == 0)
#define  MG12_16_15PL    ~(1 << 4)
#else
#define  MG12_16_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_16PL) || (G12_6PL == 0)
#define  MG12_16_16PL    ~(1 << 5)
#else
#define  MG12_16_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_16PL) || (G12_7PL == 0)
#define  MG12_16_17PL    ~(1 << 6)
#else
#define  MG12_16_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_16PL) || (G12_8PL == 0)
#define  MG12_16_18PL    ~(1 << 7)
#else
#define  MG12_16_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_16PL) || (G12_9PL == 0)
#define  MG12_16_19PL    ~(1 << 8)
#else
#define  MG12_16_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_16PL) || (G12_10PL == 0)
#define  MG12_16_110PL    ~(1 << 9)
#else
#define  MG12_16_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_16PL) || (G12_11PL == 0)
#define  MG12_16_111PL    ~(1 << 10)
#else
#define  MG12_16_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_16PL) || (G12_12PL == 0)
#define  MG12_16_112PL    ~(1 << 11)
#else
#define  MG12_16_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_16PL) || (G12_13PL == 0)
#define  MG12_16_113PL    ~(1 << 12)
#else
#define  MG12_16_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_16PL) || (G12_14PL == 0)
#define  MG12_16_114PL    ~(1 << 13)
#else
#define  MG12_16_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_16PL) || (G12_15PL == 0)
#define  MG12_16_115PL    ~(1 << 14)
#else
#define  MG12_16_115PL    0xFFFF
#endif

#define  MG12_16_116PL	0x7FFF
#define  MG12_16    (MG12_16_11PL & MG12_16_12PL & MG12_16_13PL & MG12_16_14PL & \
                    MG12_16_15PL & MG12_16_16PL & MG12_16_17PL & MG12_16_18PL & \
                    MG12_16_19PL & MG12_16_110PL & MG12_16_111PL & MG12_16_112PL & \
                    MG12_16_113PL & MG12_16_114PL & MG12_16_115PL & MG12_16_116PL)
// End of MG12_16:


#ifdef __cplusplus
}
#endif /* extern "C" */

#endif // eof

//===========================================================================
// End of File.
//===========================================================================
